[
  {
    "id": 0,
    "text": "Hindustan Zinc becomes India’s most valuable metals firm on back of silver rally. Hindustan Zinc becomes India’s top metals firm as silver prices surge, with shares rising over 6% and year-to-date gains surpassing 15%.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-23/silver-boom-makes-hindustan-zinc-most-valuable-india-metals-firm",
    "source": "Bloomberg"
  },
  {
    "id": 1,
    "text": "India’s economic activity picks pace in January, flash PMI shows. “Despite the rise in the manufacturing PMI, January’s figure remained below the 2025 average,” Pranjul Bhandari, chief India economist at HSBC",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-23/india-s-economic-activity-picks-pace-in-january-flash-pmi-shows",
    "source": "Bloomberg"
  },
  {
    "id": 2,
    "text": "Weak rupee forces India to scrap South American soy oil shipments. India has canceled soybean oil shipments from South America as a weak rupee and high global prices make imports costly, boosting palm oil demand.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-23/india-scraps-more-south-american-soy-oil-cargoes-as-rupee-slumps",
    "source": "Bloomberg"
  },
  {
    "id": 3,
    "text": "Trump’s tariffs do bite — When he actually imposes them. The withdrawal this week of a proposed charge on European nations over Greenland is the latest example of how Trump sometimes wields the tariff weapon without firing it; And the number of unrealised threats is stacking up",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/trump-s-tariffs-do-bite-when-he-actually-imposes-them",
    "source": "Bloomberg"
  },
  {
    "id": 4,
    "text": "Former Citigroup banker draws $2 billion for Nexedge Capital in India. Anirudha Taparia founded Nexedge Capital less than a year ago and has hired 60 bankers so far, with another 30 expected to join in the next few month",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-23/former-citigroup-banker-draws-2-billion-for-new-india-firm",
    "source": "Bloomberg"
  },
  {
    "id": 5,
    "text": "SEC seeks fresh pathway to advance in stalled Adani fraud case. The SEC’s lawsuit, filed in November 2024, alleges that Gautam and Sagar Adani violated US securities laws by making false and misleading representations about Adani Green Energy Ltd",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/sec-seeks-fresh-pathway-to-advance-in-stalled-adani-fraud-case",
    "source": "Bloomberg"
  },
  {
    "id": 6,
    "text": "Gold pares losses after Goldman raises year-end price forecast. Goldman Sachs lifts its year-end gold price forecast to $5,400 an ounce from a previous estimate of $4,900, citing intensifying demand from private investors and central banks",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/gold-falls-after-trump-backs-away-from-tariffs-over-greenland",
    "source": "Bloomberg"
  },
  {
    "id": 7,
    "text": "Tata set to invest $11 billion in Maharashtra AI innovation city. The positioning of Innovation City adjacent to the Navi Mumbai airport, a landmark project developed by the Adani Group, is expected to create a powerful synergy between global transit and high-tech industry",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/tata-set-to-invest-11-billion-in-maharashtra-ai-innovation-city",
    "source": "Bloomberg"
  },
  {
    "id": 8,
    "text": "‘This time is different’: How AI is redefining the memory market. AI is revolutionizing the memory market, leading to elevated valuations and persistent demand for memory and storage stocks.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/-this-time-is-different-how-ai-is-redefining-the-memory-market",
    "source": "Bloomberg"
  },
  {
    "id": 9,
    "text": "Air India braces for record $1.6 billion loss after deadly crash in Ahmedabad last year. The losses come on the back of a turbulent year for Indian aviation marked by flier anxiety, flight delays and mass cancellations by a rival carrier that has put a spotlight on the duopolistic market structure",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/air-india-braces-for-record-1-6-billion-loss-after-deadly-crash",
    "source": "Bloomberg"
  },
  {
    "id": 10,
    "text": "China’s bumper silver exports belie market fears of curbs. China transitioned to license-only management from a quota system seven years ago, leading to silver exports rising in all but one year, primarily due to increased non-ferrous refining capacity where silver is a by-product",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/china-s-bumper-silver-exports-bely-market-fear-of-restrictions",
    "source": "Bloomberg"
  },
  {
    "id": 11,
    "text": "Sun Pharma is said to mull bid for women’s wellness firm Organon. Sun Pharma is exploring a potential bid for women's wellness firm Organon, but no final decision has been made.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/sun-pharma-is-said-to-mull-bid-for-women-s-wellness-firm-organon",
    "source": "Bloomberg"
  },
  {
    "id": 12,
    "text": "Netflix amends Warner Bros deal to all cash in bidding war. Netflix has shifted to an all-cash bid, removing its stock component.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/netflix-sweetens-warner-bros-terms-to-all-cash-in-bidding-war",
    "source": "Bloomberg"
  },
  {
    "id": 13,
    "text": "Trump says Powell’s life ‘won’t be happy’ if he stays at Fed. Trump also said his search for a new Fed chair is nearing completion, with contenders including Rick Rieder, Kevin Hassett, Christopher Waller and Kevin Warsh",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/trump-warns-powell-won-t-be-very-happy-if-he-stays-on-at-fed",
    "source": "Bloomberg"
  },
  {
    "id": 14,
    "text": "Gurman Scoops ‘Campos’, Apple’s Codename for a Chatbot-Based Siri in Next Year’s Version 27 OSes. ",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/ios-27-apple-to-revamp-siri-as-built-in-iphone-mac-chatbot-to-fend-off-openai?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc2OTAyNDk2NywiZXhwIjoxNzY5NjI5NzY3LCJhcnRpY2xlSWQiOiJUOFRXOVlLR0NURlUwMCIsImJjb25uZWN0SWQiOiJDNEVEQ0FFMUZBMDU0MEJFQTI0QTlGMjExQzFFOTA4MCJ9.awOoIDGdEkCAvho8waoXR6VVVojI3jGvQHJeDjwcyrs",
    "source": "Bloomberg"
  },
  {
    "id": 15,
    "text": "AP may explore legal curbs on social media use by children under 16. Technology and Human Resources Minister Nara Lokesh said young users lack the ability to fully grasp online content, calling for a strong legal framework.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/andhra-pradesh-mulling-australia-like-under-16-social-media-ban-nara-lokesh",
    "source": "Bloomberg"
  },
  {
    "id": 16,
    "text": "Air quality spike reduces consumer demand, affects retail growth: Shoppers Stop. Air quality in the Delhi region reached record highs, with around 90% of days above an AQI of 300, far exceeding the acceptable standard of 50 set by the US EPA.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/department-store-chain-cites-india-air-pollution-as-sales-stall",
    "source": "Bloomberg"
  },
  {
    "id": 17,
    "text": "India beefing up space-based surveillance after border conflict. India plans to launch over 50 spy satellites and add night-time imaging to enhance its national security capabilities, people familiar with the matter said, after New Delhi encountered surveillance blind spots during a border conflict last year with neighbor …",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/india-beefing-up-space-based-surveillance-after-border-conflict",
    "source": "Bloomberg"
  },
  {
    "id": 18,
    "text": "EU ‘fully prepared’ to hit back over Trump’s Greenland tariffs. The European Union is ready to strike back at Donald Trump over his tariff threats as he seeks to take Greenland, European Commission President Ursula von der Leyen said, toughening her rhetoric against the US president.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/eu-fully-prepared-to-hit-back-over-trump-s-greenland-tariffs",
    "source": "Bloomberg"
  },
  {
    "id": 19,
    "text": "JPMorgan UK unit to open branch in Gujarat’s Gift City. The branch will be facilitating the trading of equities, derivatives and other financial instruments",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/jpmorgan-uk-unit-to-open-branch-in-india-s-gift-city",
    "source": "Bloomberg"
  },
  {
    "id": 20,
    "text": "Reliance tumbles into deepest oversold level in years. The selloff has erased about $29 billion from the company’s market value so far in 2026",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/india-s-reliance-tumbles-into-deepest-oversold-level-in-years",
    "source": "Bloomberg"
  },
  {
    "id": 21,
    "text": "Real estate giant K Raheja eyes $700 million IPO. K Raheja Corp plans a $700 million IPO, potentially becoming India's largest real estate listing amid robust market activity.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/india-property-developer-k-raheja-said-to-weigh-700-million-ipo",
    "source": "Bloomberg"
  },
  {
    "id": 22,
    "text": "Tata Motors eyes bid for 6,000 e-buses without joining price wars. Tata Motors Ltd is preparing to bid for a government tender of as many as 6,000 electric buses, as it seeks to claw back market share without joining the steep discounting that has defined recent auctions, its top official said.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/tata-eyes-bid-for-6-000-e-buses-without-joining-price-wars",
    "source": "Bloomberg"
  },
  {
    "id": 23,
    "text": "India allows some exports of wheat products after three-year ban. India’s decision to restart some exports, which were halted in May 2022, coincides with the country’s trade talks with the US",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/india-allows-some-exports-of-wheat-products-after-three-year-ban",
    "source": "Bloomberg"
  },
  {
    "id": 24,
    "text": "The list of people invited to Trump’s Board of Peace for Gaza. Trump wants the signing ceremony to take place in Davos on Thursday, despite calls from some of those invited to rewrite the terms of the panel",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/the-list-of-people-invited-to-trump-s-board-of-peace-for-gaza",
    "source": "Bloomberg"
  },
  {
    "id": 25,
    "text": "Silver hits record high as US-EU crisis over Greenland simmers. The US’s aggression toward its NATO allies has rattled markets, buoying demand for havens and reviving the ‘Sell America’ trade",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/silver-rises-to-record-as-us-eu-tensions-over-greenland-persist",
    "source": "Bloomberg"
  },
  {
    "id": 26,
    "text": "RBI needs to ramp up bond purchases to cool yields, funds say. RBI has injected a record 14.5 trillion rupees of liquidity since end-December 2024 through cash reserve-ratio cuts, open-market bond purchases and foreign-exchange swaps,",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/rbi-needs-to-ramp-up-bond-purchases-to-cool-yields-funds-say",
    "source": "Bloomberg"
  },
  {
    "id": 27,
    "text": "EU eyes tariffs on €93 billion of US goods over Trump’s latest 10% levy threat. The European Union is in talks to potentially impose tariffs on €93 billion ($108 billion) of US goods if President Donald Trump follows through on his threat to hit European countries with a 10 per cent levy on Feb. 1.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/eu-eyes-tariffs-on-93-billion-of-us-goods-over-new-trump-threat",
    "source": "Bloomberg"
  },
  {
    "id": 28,
    "text": "Jane Street’s India unit saw trading gains soar 494% before curbs. The financial results cast new light on the scale of Jane Street’s trading operations in India, where the company is currently facing investigations by the stock market regulator.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/jane-street-india-unit-saw-trading-gains-soar-494-before-curbs",
    "source": "Bloomberg"
  },
  {
    "id": 29,
    "text": "Govt green-lights plan to buy 114 French Rafale jets. The purchase would be a significant upgrade for the Indian Air Force, whose fighter fleet, largely of Russian origin, is dwindling",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-16/india-inches-closer-to-buying-114-french-rafale-jets",
    "source": "Bloomberg"
  },
  {
    "id": 30,
    "text": "Walmart’s CEO of international business to depart company. Walmart's international CEO, Kathryn McLay, is stepping down; a successor will be named soon as leadership transitions.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-15/walmart-says-its-international-ceo-is-leaving-company",
    "source": "Bloomberg"
  },
  {
    "id": 31,
    "text": "Mitsubishi to buy Aethon US gas assets in $5.2 billion deal. Mitsubishi acquires Aethon Energy's US gas assets for $5.2 billion, marking a major investment in American shale.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-16/mitsubishi-to-buy-us-gas-assets-from-aethon-in-5-2-billion-deal",
    "source": "Bloomberg"
  },
  {
    "id": 32,
    "text": "Global corporate bond yield premiums fall to lowest since 2007. Money managers have been diving into the rally in credit due to the prospects of interest-rate cuts by the Federal Reserve and some other central banks",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-16/global-corporate-bond-yield-premiums-fall-to-lowest-since-2007",
    "source": "Bloomberg"
  },
  {
    "id": 33,
    "text": "Silver dips after US tariff pause, but set for hefty weekly gain. Silver prices dip after the US pauses tariffs but still achieve a significant weekly gain amid high demand.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-15/silver-dips-after-us-pause-on-critical-minerals-import-tariff",
    "source": "Bloomberg"
  },
  {
    "id": 34,
    "text": "Tesla’s India letdown spurs discounts on unsold Model Y SUVs. The tepid India debut comes at a time when the company is seeing faltering global demand. Its worldwide sales fell in 2025 for a second consecutive year, dropping the company behind China’s BYD Co. as the top-seller of EVs.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/tesla-s-india-letdown-spurs-discounts-on-unsold-model-y-suvs",
    "source": "Bloomberg"
  },
  {
    "id": 35,
    "text": "China bans cybersecurity products from top US, Israeli firms. Chinese companies’ use of such products could result in sensitive data being sent overseas or create other vulnerabilities for customers, says government directive",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/china-bans-cyber-products-from-top-us-israeli-security-firms",
    "source": "Bloomberg"
  },
  {
    "id": 36,
    "text": "US visa crackdown: A list of the 75 countries affected. US suspends immigrant visa processing for 75 countries starting January 21, intensifying its immigration crackdown.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-15/here-s-the-list-of-75-countries-affected-by-us-visa-crackdown",
    "source": "Bloomberg"
  },
  {
    "id": 37,
    "text": "US set to suspend visa processing for dozens of countries. While citizens of Afghanistan, Iran, Russia and Somalia already have little chance of getting a US visa, the move is likely to shut the door for people from nations such as Brazil",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/us-freezes-visa-processing-for-dozens-of-countries-fox-reports",
    "source": "Bloomberg"
  },
  {
    "id": 38,
    "text": "Bitcoin rally sees $600 million in bearish crypto bets wiped out. Bitcoin slumped to a loss of more than 6% for 2025 after ending the year in muted fashion, trading in a narrow range and proving largely indifferent to rallies in stocks and precious metals",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/bitcoin-btc-claims-two-month-high-of-over-96-000-on-macro-tailwinds",
    "source": "Bloomberg"
  },
  {
    "id": 39,
    "text": "Aluminium, copper settle after bull run into 2026. Aluminium and copper prices stabilize after a bullish run, amid concerns over demand and geopolitical risks impacting the metals market.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-13/aluminum-near-record-high-and-tin-extends-surge-on-supply-angst",
    "source": "Bloomberg"
  },
  {
    "id": 40,
    "text": "GA-backed Acko eyes banks for $350 million IPO. Acko is expected to appoint advisers in the coming weeks, they said. Deliberations are ongoing and the terms of the potential offering could still change",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-13/ga-backed-acko-said-to-seek-banks-for-350-million-india-ipo",
    "source": "Bloomberg"
  },
  {
    "id": 41,
    "text": "China examines foreign ETF trades after Jane Street India probe. China is investigating foreign ETF trades by Jane Street following regulatory issues in India, prompting UBS to pause some transactions.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-13/china-examines-foreign-etf-trades-after-jane-street-india-probe",
    "source": "Bloomberg"
  },
  {
    "id": 42,
    "text": "India’s debt fund managers turn tactical as returns get harder. This marks a shift in their strategy from last year when money managers largely preferred longer duration, as the Reserve Bank of India slashed rates by 125 basis points",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-13/india-s-debt-fund-managers-turn-tactical-as-returns-get-harder",
    "source": "Bloomberg"
  },
  {
    "id": 43,
    "text": "Deutsche bank’s $2.5 billion India retail assets draw final bids. Deutsche Bank's $2.5 billion retail assets in India attract bids from Kotak Mahindra Bank and Federal Bank amid market shifts.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-12/deutsche-bank-s-2-5-billion-india-retail-assets-draw-final-bids",
    "source": "Bloomberg"
  },
  {
    "id": 44,
    "text": "Reliance halts cell-making plans after failed bid for China tech. China has stepped up scrutiny of clean-energy technology deals as it seeks to protect strategic advantages in sectors, complicating localization efforts by foreign manufacturer",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-12/reliance-halts-cell-making-plans-after-failed-bid-for-china-tech",
    "source": "Bloomberg"
  },
  {
    "id": 45,
    "text": "Nvidia, Tesla chase same self-driving goal via varying paths. Nvidia wants to supply the intelligence layer for autonomy without building the car itself, but it still wants to own the technology that makes self-driving a reality",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-10/nvidia-and-tesla-chase-same-self-driving-goal-via-varying-paths",
    "source": "Bloomberg"
  },
  {
    "id": 46,
    "text": "Traders send stocks to fresh highs in strong first week of 2026. Investors also delved into other areas of the market, including small-caps and so-called value stocks, traditionally a sign of confidence in the economy.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/stocks-rise-as-traders-weigh-jobs-data-brace-for-tariff-ruling",
    "source": "Bloomberg"
  },
  {
    "id": 47,
    "text": "Gold investors stay bullish after record rally in 2025. Bloomberg spoke with more than a dozen money managers, whose firms collectively handle trillions of dollars of assets, to gauge sentiment after the historic year. Most of them said they’ve opted not to take too much money off the table, holding conviction in …",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-10/gold-investors-stay-bullish-after-record-rally-in-2025",
    "source": "Bloomberg"
  },
  {
    "id": 48,
    "text": "India’s record rice crop is set to deepen slide in global prices. Indian farmers are wrapping up another bumper rice harvest, adding a wave of grain to the global market that’s already well supplied and likely putting further pressure on benchmark prices.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/india-s-record-rice-crop-is-set-to-deepen-slide-in-global-prices",
    "source": "Bloomberg"
  },
  {
    "id": 49,
    "text": "Reliance Industries sees $15 billion market cap erosion at start of 2026. Investor sentiment has also cooled after retailers flagged weaker consumer demand and a US senator proposed legislation targeting buyers of Russian crude",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/reliance-slides-6-in-bruising-start-to-year-ahead-of-earnings",
    "source": "Bloomberg"
  },
  {
    "id": 0,
    "text": "‘Inside Trump’s Head-Spinning Greenland U-Turn’. ",
    "category": "business",
    "url": "https://www.wsj.com/politics/national-security/a-piece-of-ice-for-world-protection-trump-demands-europe-cut-deal-on-greenland-cc1014f6?st=2XDhnR",
    "source": "The Wall Street Journal"
  },
  {
    "id": 1,
    "text": "Study Concludes That Americans Are the Ones Paying for Tariffs. ",
    "category": "business",
    "url": "https://www.wsj.com/economy/trade/americans-are-the-ones-paying-for-tariffs-study-finds-e254ed2e?st=pw4q2j",
    "source": "The Wall Street Journal"
  },
  {
    "id": 2,
    "text": "Micron to Buy Taiwan Plant for $1.8 Billion. The Boise, Idaho-based company plans to acquire the Taiwanese chip-making site to meet surging demand for memory-storage products.",
    "category": "business",
    "url": "https://www.wsj.com/business/deals/micron-to-buy-taiwan-plant-for-1-8-billion-5eef73e5",
    "source": "The Wall Street Journal"
  },
  {
    "id": 3,
    "text": "S&P 500 Slips After Bank Earnings. Stocks were lower after more bank earnings rolled in.",
    "category": "business",
    "url": "https://www.wsj.com/finance/u-s-futures-fall-precious-metals-gain-on-iranian-unrest-d8a82a84",
    "source": "The Wall Street Journal"
  },
  {
    "id": 4,
    "text": "Jamie Dimon Warns Political Interference With Fed Would Push Up Rates. The JPMorgan chief reiterated his support of the Fed after the DOJ investigation.",
    "category": "business",
    "url": "https://www.wsj.com/economy/central-banking/jamie-dimon-warns-political-interference-with-fed-would-push-up-rates-60ccfed6",
    "source": "The Wall Street Journal"
  },
  {
    "id": 5,
    "text": "Dow Futures Inch Down Ahead of Inflation Data, Bank Earnings. U.S. stock futures inched lower amid bank earnings and ahead of inflation data.",
    "category": "business",
    "url": "https://www.wsj.com/finance/global-markets-mixed-as-investors-await-u-s-inflation-print-a1c75430",
    "source": "The Wall Street Journal"
  },
  {
    "id": 6,
    "text": "What 10% Credit-Card Rate Cap Would Mean for Your Wallet. President Trump’s call for a cap promises to save Americans billions in interest but also can lead to tightened access to credit.",
    "category": "business",
    "url": "https://www.wsj.com/personal-finance/credit/what-a-10-credit-card-rate-cap-would-mean-for-your-wallet-365f2f8d",
    "source": "The Wall Street Journal"
  },
  {
    "id": 7,
    "text": "China Has Been Gorging on Black-Market Oil. That’s Now Getting Harder.. The official market for crude could soon start to feel disturbances as the U.S. and Europe crack down on illicit trading.",
    "category": "business",
    "url": "https://www.wsj.com/business/energy-oil/china-has-been-gorging-on-black-market-oil-thats-now-getting-harder-3b5e1f0c",
    "source": "The Wall Street Journal"
  },
  {
    "id": 8,
    "text": "Jim Moylan and the Moylan Arrow. ",
    "category": "business",
    "url": "https://www.wsj.com/business/autos/ford-gas-arrow-inventor-jim-moylan-6b2ef066?st=uhr6ym&reflink=desktopwebshare_permalink",
    "source": "The Wall Street Journal"
  },
  {
    "id": 9,
    "text": "China’s EV dominance at home is squeezing out foreign armakers. China’s electrification trend helped local brands take nearly two-thirds of the country’s passenger-car market.",
    "category": "business",
    "url": "https://www.wsj.com/business/autos/china-auto-sales-slump-amid-slowing-demand-379e7c92",
    "source": "The Wall Street Journal"
  },
  {
    "id": 10,
    "text": "Shell Flags Weak Oil-Trading Performance. Shell warned that a weak oil-trading performance would weigh on its earnings, compounding what is shaping up to be a challenging period as prices continue to...",
    "category": "business",
    "url": "https://www.wsj.com/business/energy-oil/shell-expects-higher-oil-and-gas-production-but-flags-downstream-weakness-613ad4bd",
    "source": "The Wall Street Journal"
  },
  {
    "id": 11,
    "text": "Stocks Mixed While Oil Futures Decline. The Dow industrials crept higher, edging toward the 50,000-point milestone, while the Nasdaq composite and S 500 were close to flat.",
    "category": "business",
    "url": "https://www.wsj.com/finance/stocks/global-markets-u-s-futures-nervy-as-geopolitical-tensions-sour-sentiment-c3bed2c2",
    "source": "The Wall Street Journal"
  },
  {
    "id": 12,
    "text": "Copper Extends Rally, Bursting Through $13,000 a Ton. The rally has been driven by concerns over tightening supply and tariff uncertainty in the U.S.",
    "category": "business",
    "url": "https://www.wsj.com/finance/commodities-futures/copper-extends-rally-bursting-through-13-000-a-ton-9e66c958",
    "source": "The Wall Street Journal"
  },
  {
    "id": 13,
    "text": "Energy & Utilities Roundup: Market Talk. Find insight on U.S. Gulf Coast refiners, Chevron, Adani Power and more in the latest Market Talks covering Energy and Utilities.",
    "category": "business",
    "url": "https://www.wsj.com/business/energy-utilities-roundup-market-talk-de2813fc",
    "source": "The Wall Street Journal"
  },
  {
    "id": 14,
    "text": "Lululemon Founder Chip Wilson Launches Proxy Fight to Change Board. The founder’s proposal seeks to make boardroom revisions before the athletic-apparel company chooses a new CEO.",
    "category": "business",
    "url": "https://www.wsj.com/business/lululemon-activist-investor-campaign-70c61e8e",
    "source": "The Wall Street Journal"
  },
  {
    "id": 15,
    "text": "Silver and Gold Prices Rally; Stocks Hold Near Records. The year’s run-up in precious metals broke new ground, while U.S. stocks held near record highs.",
    "category": "business",
    "url": "https://www.wsj.com/finance/stocks/global-stocks-markets-dow-update-48806b61",
    "source": "The Wall Street Journal"
  },
  {
    "id": 16,
    "text": "Energy & Utilities Roundup: Market Talk. Find insight on the sale of BP’s stake in its Castrol lubricants, oil futures and more in the latest Market Talks covering Energy and Utilities.",
    "category": "business",
    "url": "https://www.wsj.com/business/energy-utilities-roundup-market-talk-27a9d211",
    "source": "The Wall Street Journal"
  },
  {
    "id": 0,
    "text": "I'm Not Exaggerating AT ALL When I Say The Whole World Is Getting Dumber And Dumber In 2026, And These Posts Are All The Proof I Need. Well, here's to 2027, I guess.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/daves4/dumbest-things-people-posted-january-2026",
    "source": "Buzzfeed"
  },
  {
    "id": 1,
    "text": "Guy Fieri’s Son Hilariously Trolled His Unrecognizable New Look, And It’s Too Good. “It’s like Tucker Carlson and John Goodman had a baby.”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/guy-fieri-unrecognizable-new-look-goes-viral",
    "source": "Buzzfeed"
  },
  {
    "id": 2,
    "text": "“We Totally Scammed The System”: People Are Divided After Kim Kardashian Revealed How She Used Britney Spears To Boost Her Celebrity Profile Before She Was Famous. Kim previously admitted that she used to be “embarrassingly obsessed” with getting famous.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/stephaniesoteriou/kim-kardashian-scammed-system-fame-britney-spears-reacts",
    "source": "Buzzfeed"
  },
  {
    "id": 3,
    "text": "Adults Are Revealing The Exact Moment They Realized Their Childhood Was Over, And Excuse Me, I'm A Little Emotional. \"I don't know if a lot of people can recall a specific day, but I remember mine being on a Sunday.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/consheabrown/moments-people-realized-not-a-kid",
    "source": "Buzzfeed"
  },
  {
    "id": 4,
    "text": "Brooklyn Beckham And Nicola Peltz’s Wedding DJ Just Spilled So Much Tea About The Day As Sources Say David And Victoria Beckham Are “Horrified About Everything”. “I did the brunch on the Sunday, which was the most awkward part of it all because everything that had gone on on the actual wedding night was discussed amongst all the guests the next morning.”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/stephaniesoteriou/brooklyn-beckham-nicola-peltz-wedding-dj-tells-all",
    "source": "Buzzfeed"
  },
  {
    "id": 5,
    "text": "“Had He Walked Away, It Would Have Been Justified”: People Are Outraged After 73-Year-Old Delroy Lindo Was Forced To Correct An Interviewer Who Called Him An “Emerging Artist”. “I’m also not an emerging artist; I’ve been around for a few years.”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/delroy-lindo-corrects-interviewer-called-him-emerging-artist",
    "source": "Buzzfeed"
  },
  {
    "id": 6,
    "text": "20 People Who Dated Someone Much, Much, Much, Much, Much, Much, Much, Much Dumber Than Anyone You've Ever Dated. \"I was traveling on business and talking to my girlfriend at the end of the night. She commented on the beautiful full moon where we lived and asked me if I had the same full moon where I was.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/ajanibazile/dumb-partner-quotes-jan-2026",
    "source": "Buzzfeed"
  },
  {
    "id": 7,
    "text": "Both Republicans And Democrats Are Sharing Their Thoughts On ICE Detaining A 5-Year-Old In Minnesota. According to the Associated Press, ICE took 5-year-old Liam Conejo Ramos from a running car in his family's driveway.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/bellaarnold/ice-detaining-five-year-old-opinions",
    "source": "Buzzfeed"
  },
  {
    "id": 8,
    "text": "\"A Staggering Number Of Americans Are About To Realize That The Government Had The Capacity To Help Them All Along Simply Chose Not To\": 36 Of The Very, Very, Very Best Political Tweets Of The Week. \"My guy you broke all Ten Commandments.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/morgansloss1/best-political-tweets-1-23-2026",
    "source": "Buzzfeed"
  },
  {
    "id": 9,
    "text": "Minnesota Protesters Braved Negative 10-Degree Weather Today To Protest ICE, And The Photos Are Unbelievable. Hundreds of businesses closed, and thousands hit the streets to protest ICE, with roughly 100 clergy members arrested at Minneapolis–St. Paul Airport.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alanavalko/minnesota-protests-photos-jan-23",
    "source": "Buzzfeed"
  },
  {
    "id": 10,
    "text": "Donald Trump's Latest Tweet Basically Proves He Has No Idea How Global Warming Works. \"BREAKING: Trump is an imbecile...\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/meganeliscomb/trump-global-warming-winter-storms",
    "source": "Buzzfeed"
  },
  {
    "id": 11,
    "text": "A Year Into Trump's Second Term, People Are Speaking Out About The Chaos, Fatigue, And General Frustration. The internet weighed in on Trump's first year back, and the mood is rough.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/briangalindo/trumps-second-term-opinions",
    "source": "Buzzfeed"
  },
  {
    "id": 12,
    "text": "Medical Professionals, Tell Us The Things That Everyone Should Know But Somehow Don't. We can't all get medical degrees, but we can all become a *little* more knowledgeable.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alanavalko/facts-people-should-know-about-bodies",
    "source": "Buzzfeed"
  },
  {
    "id": 13,
    "text": "People Are Sharing The Moment They Realized They Had Changed Forever, And Some Of These Are Pretty Dark. \"The Brock Turner case in my early 20s. That was the day I learned the world doesn't care about women.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/kanksharaina/life-changing-moments-dark-stories-reddit",
    "source": "Buzzfeed"
  },
  {
    "id": 14,
    "text": "Donald Trump Offered Up An *Interesting* Explanation For His New Hand Bruise. I wonder if that \"cream\" helped.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/mjs538/bruise-explanation",
    "source": "Buzzfeed"
  },
  {
    "id": 15,
    "text": "Women, Tell Us About The Moment You Found Out Your Date Was A Trump Supporter. No matter how many times he tried pulling the ~fiscally conservative but socially liberal~ card, the truth always has a way of slipping out.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/lily_grossinger/dating-maga-add-yours",
    "source": "Buzzfeed"
  },
  {
    "id": 16,
    "text": "What’s a tiny inconvenience that completely ruins your day?. The \"my entire life is falling apart because my charger fell behind the bed\" type of energy.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alpacagalore/tiny-inconvenience-community-dq",
    "source": "Buzzfeed"
  },
  {
    "id": 17,
    "text": "\"I’m Specifically Told Not To Mention This Problem To The Public\" – 16 Dark Industry Secrets That May Shock You. \"I suspect that when we look back, this time in history will be some type of tipping point for some type of major change in how we understand education.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/bendzialdowski/dark-industry-secrets-and-facts",
    "source": "Buzzfeed"
  },
  {
    "id": 18,
    "text": "Healthcare Workers, Share How ICE Has Impacted Your Job. Healthcare workers, share your story.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/michaelabramwell/add-yours-healthcare-workers-react-to-ice",
    "source": "Buzzfeed"
  },
  {
    "id": 19,
    "text": "From “Brand-Building” Classes To 8-Hour Music Studio Sessions, Kim Kardashian Revealed What Homeschooling Looks Like For Her Daughter North West. “I’ve now added ‘teacher’ to my role, ‘cause she wants me involved in all the things,” Kim said.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/kim-kardashian-shares-north-west-homeschooling-schedule",
    "source": "Buzzfeed"
  },
  {
    "id": 20,
    "text": "Which books do you think need to be made into a TV show or movie?. For more questions like this delivered straight to your inbox (or if you want to suggest your own question!), sign up for my newsletter, Screen Time!View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/noradominick/which-books-do-you-want-to-see-adapted-in-shows-or-movies-dq",
    "source": "Buzzfeed"
  },
  {
    "id": 21,
    "text": "\"People Are Too Scared To Show Up For School And Work\" — This Woman Shared EXACTLY What Life Is Like In A City Under ICE, And It's Harrowing. \"When enforcement practices deter people from accessing education, healthcare, and basic stability, the harm extends beyond individuals to entire communities.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alexalisitza/life-under-ice-viral-video",
    "source": "Buzzfeed"
  },
  {
    "id": 22,
    "text": "\"Looking Back, It Wasn't Hygienic\": People Are Sharing The 17 Family Habits That Felt Totally Normal Growing Up (But Were Actually Super Weird). Okay, I have to confess... Anonymous #14? That was me. Yup, the howling one. I love my dad.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/jennifer_mcphee/normal-family-things-that-are-actually-weird",
    "source": "Buzzfeed"
  },
  {
    "id": 23,
    "text": "People Are Sharing Examples Of Movies That Would’ve Been WAY Better With A Different Actor, And Some Of These Are Seriously Hot Takes. And what if I said I FULLY agree with number 8...View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/ellendurney/movies-that-would-be-better-with-different-actors",
    "source": "Buzzfeed"
  },
  {
    "id": 24,
    "text": "20 Common Parenting Practices From Different Countries That Might Surprise Americans. \"In Japan, it's pretty much unheard of. In fact, if people overheard it, they would call the police for a wellness check.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/hannahloewentheil/common-parenting-practices-abroad",
    "source": "Buzzfeed"
  },
  {
    "id": 25,
    "text": "The Whole Internet, Including Gavin Newsom, Is Calling Out Karoline Leavitt After Her Latest Claim About Trump. \"this is like north korean level glazing.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/morgansloss1/karoline-leavitt-criticized-after-trump-speech-claims",
    "source": "Buzzfeed"
  },
  {
    "id": 26,
    "text": "People Are Dragging JD Vance For The Extremely Weird Thing He Just Said About The Economy. \"At least he's admitting what ship we are on.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/meganeliscomb/jd-vance-economy-speech-titanic",
    "source": "Buzzfeed"
  },
  {
    "id": 27,
    "text": "Let’s Talk About What’s Actually Going On With “Exploding Trees”. Well, you learn something new every day.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/mjs538/exploding-trees",
    "source": "Buzzfeed"
  },
  {
    "id": 28,
    "text": "The White House Edited Nekima Levy Armstrong's Arrest Photo To Look Like She's Crying. \"The memes will continue,\" a White House spokesperson said.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/natashajokic1/nekima-levy-armstrong-arrest-white-house",
    "source": "Buzzfeed"
  },
  {
    "id": 29,
    "text": "\"They Teach Us About The Olive Oil Mafia In Culinary School\": Nearly A Million People Are Shocked After Learning About This One Olive Oil Test You Need To Be Doing Before Purchasing A Bottle. If your olive oil bottle doesn’t list a harvest date, that’s a red flag.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/kristatorres/olive-oil-test-tiktok",
    "source": "Buzzfeed"
  },
  {
    "id": 30,
    "text": "Here Are The \"Disrespectful\" Comments Naomi Osaka Apologized For After Her Opponent's Cold Australian Open Handshake. \"I don’t like disrespecting people. That's not what I do.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/chelseastewart/naomi-osaka-apologizes-sorana-cirstea-comments",
    "source": "Buzzfeed"
  },
  {
    "id": 31,
    "text": "If You've Ever Had An Experience With A \"Toxic\" Mom Group, Tell Us About It. Surely, Ashley Tisdale isn't the only one.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/aronawriting/toxic-mom-group-experience-add-yours",
    "source": "Buzzfeed"
  },
  {
    "id": 32,
    "text": "Gypsy-Rose Blanchard Shared A Rare Glimpse At What Her Natural Short Hair Looks Like. “No wig today… just me.”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/gypsy-rose-blanchard-reveals-natural-short-hair",
    "source": "Buzzfeed"
  },
  {
    "id": 33,
    "text": "Jennette McCurdy Opens Up About Writing Debut Novel \"Half His Age\" And Exploring Female Rage. In her debut novel, \"Half His Age,\" Jennette McCurdy explores rage, desire, and self-discovery. We sat down with Jennette to learn about her creative journey and finding her voice.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/andrewfirriolo/jennette-mccurdy-half-his-age-book-interview",
    "source": "Buzzfeed"
  },
  {
    "id": 34,
    "text": "Here’s What Blake Lively Said About Confronting Justin Baldoni For Allegedly Asking “Invasive” Questions About Her Weight. A previous filing claimed that celebrity guests walked in and out of Ryan’s penthouse while he allegedly berated Justin in a “humiliating” manner.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/blake-lively-ryan-reynolds-justin-baldoni-confrontation",
    "source": "Buzzfeed"
  },
  {
    "id": 35,
    "text": "\"It's Physically And Mentally Exhausting\": Medical Professionals Are Revealing The \"Dark Secrets\" About Their Jobs That No One Knows. \"I've been working in healthcare for over 20 years. Healthcare is no longer about providing the best care for the patient; it's about making money.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/lizmrichardson/doctors-nurses-work-dark-secrets",
    "source": "Buzzfeed"
  },
  {
    "id": 36,
    "text": "The 2026 Academy Award Nominations Are Here, And It's A Great Day To Be Timothée Chalamet. The awards race just got seriously exciting.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/ellendurney/oscar-nominations-2026-full-list",
    "source": "Buzzfeed"
  },
  {
    "id": 37,
    "text": "If you had to compete on a reality show, which one would it be?. I don't know about you, but \"The Amazing Race\" is calling my name.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/avinashnarayanan1/competing-reality-show-dq",
    "source": "Buzzfeed"
  },
  {
    "id": 38,
    "text": "'We Weren't Throwing Knives At Each Other...\", Parents Are Reliving The Incredibly Idiotic Things Their Children Have Done. \"Mum, I know you can't put a knife in the toaster, but can I put a fork in there?\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/bendzialdowski/things-dumb-kids-have-done",
    "source": "Buzzfeed"
  },
  {
    "id": 39,
    "text": "Amid Loaded Discourse, Meghan Trainor Explained Why She Chose To Have Her Third Child Via Surrogate. “I want people to know that surrogacy is just another beautiful way to build a family. It’s not something to whisper about or judge.”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/meghan-trainor-explains-why-she-chose-surrogacy",
    "source": "Buzzfeed"
  },
  {
    "id": 40,
    "text": "Former Home Renovation Show Contestants Are Revealing The Good, Bad, And Ugly Behind-The-Scenes Details And Holyyyyy Crappp. \"In reality, it was literally things stuck together with staples and tape.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/laurengarafano/home-makeover-show-aftermath-stories",
    "source": "Buzzfeed"
  },
  {
    "id": 41,
    "text": "18 Actors Who Revived Their Careers With One Role, Vs. 14 Stars That Literally Never Recovered From A Flop. \"He went from 'who's that?' to winning two Academy Awards in the space of three years.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/ellendurney/actors-who-revived-careers-vs-who-never-came-back",
    "source": "Buzzfeed"
  },
  {
    "id": 42,
    "text": "\"Girls Are Expected To Act Like Adults, But Once They Are Adults, They're Treated Like Children\": 32 Ways You May Not Even Realize Sexism Hurts Women Every Single Day. \"'Helping around the house' or 'babysitting the kids' when they are, in fact, also his house and his kids.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/hannahdobro/examples-of-subtle-sexism-in-everyday-life",
    "source": "Buzzfeed"
  },
  {
    "id": 43,
    "text": "Amid Trump's Obsession With Greenland, This Viral Social Media Post Criticizes Americans Who Go Online And Say They Didn't Vote For Him. \"You can say you're different from the rest of Americans, but to the rest of the world, that distinction doesn't exist.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/morgansloss1/greenland-post-criticizing-americans-goes-viral",
    "source": "Buzzfeed"
  },
  {
    "id": 44,
    "text": "Grown-Ups Who've Gone No Contact With Their Families Are Revealing What It's *Really* Like, And I'm Genuinely Speechless. I had no idea.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/jennifer_mcphee/people-share-what-its-like-to-cut-off-family",
    "source": "Buzzfeed"
  },
  {
    "id": 45,
    "text": "This Double Murder Mystery Is Kicking Off A Year Of Jaw-Dropping Trials. A Virginia man being tried for allegedly plotting with his family's au pair — his secret girlfriend — to kill his wife and a stranger is the first of many high-profile trials scheduled for 2026.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/drumoorhouse/au-pair-murders-2026-trials",
    "source": "Buzzfeed"
  },
  {
    "id": 46,
    "text": "\"Like Clockwork\": The Internet Is Losing It After Ted Cruz Was Spotted Traveling To California While Texas Braces For Another Major Winter Storm. \"You have to admire the consistency from @tedcruz. When there's a crisis in Texas, he sprints out of town.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alanavalko/ted-cruz-texas-winter-storm-laguna-beach",
    "source": "Buzzfeed"
  },
  {
    "id": 47,
    "text": "Here’s Why So Many People Say Trump’s One-Year Press Conference Went Completely Off The Rails. \"Who knew Obama winning the Nobel Peace Prize would lead to so much chaos...\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/mjs538/one-year-press-conference-recap",
    "source": "Buzzfeed"
  },
  {
    "id": 48,
    "text": "\"This Is Our National Humiliation\": Trump Went On A Rant About Invading Iceland, Apparently Confusing It With Greenland, And People Are Horrified. \"I know it’s exhausting to point out the daily hypocrisy but come on.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/meganeliscomb/trump-confusing-iceland-and-greenland",
    "source": "Buzzfeed"
  },
  {
    "id": 49,
    "text": "Jennifer Lawrence Was Too Stunned To Speak After Amy Poehler Pointed Out That She Was Experiencing An Unassuming Perimenopause Symptom. “There is a veil of secrecy when it comes to peri/menopause. I'm glad there are people that will talk about it, because some of us have no idea.”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/jennifer-lawrence-stunned-amy-poehler-perimenopause-comment",
    "source": "Buzzfeed"
  },
  {
    "id": 0,
    "text": "Realme 16 Pro Plus Review: Big Camera Energy, Familiar Realme Feel. Realme 16 Pro Plus Review: Big Camera Energy, Familiar Realme Feelmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/105011/realme-16-pro-plus-review-big-camera-energy-familiar-realme-feel",
    "source": "Mashable"
  },
  {
    "id": 1,
    "text": "Biggest iPhone Upgrade in Years? iPhone 18 Pro Leaks Reveal New Chip and Staggered Launch. Biggest iPhone Upgrade in Years? iPhone 18 Pro Leaks Reveal New Chip and Staggered Launchmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/105002/biggest-iphone-upgrade-in-years-iphone-18-pro-leaks-reveal-new-chip-and-staggered-launch",
    "source": "Mashable"
  },
  {
    "id": 2,
    "text": "Apple Could Turn Siri Into Full AI Chatbot With iOS 27 Update, Challenging ChatGPT. Apple Could Turn Siri Into Full AI Chatbot With iOS 27 Update, Challenging ChatGPTmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104985/apple-could-turn-siri-into-full-ai-chatbot-with-ios-27-update-challenging-chatgpt",
    "source": "Mashable"
  },
  {
    "id": 3,
    "text": "TikTok is rolling out a new age-detection system in the EU. TikTok is rolling out a new age-detection system in the EUmashable.com",
    "category": "entertainment",
    "url": "https://sea.mashable.com/tech/41684/tiktok-is-rolling-out-a-new-age-detection-system-in-the-eu",
    "source": "Mashable"
  },
  {
    "id": 4,
    "text": "Apple MacBook Pro M5 and M5 Max MacBook Pro tipped to launch on January 28; Here’s all you need to know. Apple MacBook Pro M5 and M5 Max MacBook Pro tipped to launch on January 28; Here’s all you need to knowmashable.com",
    "category": "entertainment",
    "url": "https://me.mashable.com/tech/65879/apple-macbook-pro-m5-and-m5-max-macbook-pro-tipped-to-launch-on-january-28-heres-all-you-need-to-kno",
    "source": "Mashable"
  },
  {
    "id": 5,
    "text": "3 things 'The Pitt' episode '8:00 AM' gets right about AI in medicine, and 1 big thing it gets wrong. 3 things 'The Pitt' episode '8:00 AM' gets right about AI in medicine, and 1 big thing it gets wrongmashable.com",
    "category": "entertainment",
    "url": "https://me.mashable.com/tech/65823/3-things-the-pitt-episode-800-am-gets-right-about-ai-in-medicine-and-1-big-thing-it-gets-wrong",
    "source": "Mashable"
  },
  {
    "id": 6,
    "text": "Grok Says It Has Restricted Image Generation To Subscribers After Deepfake Concerns. But Has It?. Grok Says It Has Restricted Image Generation To Subscribers After Deepfake Concerns. But Has It?mashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104511/grok-says-it-has-restricted-image-generation-to-subscribers-after-deepfake-concerns-but-has-it",
    "source": "Mashable"
  },
  {
    "id": 7,
    "text": "Google Makes Gemini 3 AI Tools Free on Gmail, Sundar Pichai Reveals Big Update. Google Makes Gemini 3 AI Tools Free on Gmail, Sundar Pichai Reveals Big Updatemashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104469/google-makes-gemini-3-ai-tools-free-on-gmail-sundar-pichai-reveals-big-update",
    "source": "Mashable"
  },
  {
    "id": 8,
    "text": "WhatsApp Group Chats Are Getting a Big Upgrade: Here’s What’s New. WhatsApp Group Chats Are Getting a Big Upgrade: Here’s What’s Newmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104408/whatsapp-group-chats-are-getting-a-big-upgrade-heres-whats-new",
    "source": "Mashable"
  },
  {
    "id": 9,
    "text": "Samsung Galaxy S26 Ultra to Feature Apple-Like Design Tweaks: What to Expect. Samsung Galaxy S26 Ultra to Feature Apple-Like Design Tweaks: What to Expectmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104226/samsung-galaxy-s26-ultra-to-feature-apple-like-design-tweaks-what-to-expect",
    "source": "Mashable"
  },
  {
    "id": 10,
    "text": "Vijay Sales Apple Days Sale Ending Soon: Get Upto ₹ 20,000 Discount On iPhone 17 Pro Max, iPhone 16 And More. Vijay Sales Apple Days Sale Ending Soon: Get Upto ₹ 20,000 Discount On iPhone 17 Pro Max, iPhone 16 And Moremashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104190/vijay-sales-apple-days-sale-ending-soon-get-upto-rs-20000-discount-on-iphone-17-pro-max-iphone-16-an",
    "source": "Mashable"
  },
  {
    "id": 11,
    "text": "Apple Vision Pro is failing. Here's why that matters.. Apple Vision Pro is failing. Here's why that matters.mashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104182/apple-vision-pro-is-failing-heres-why-that-matters",
    "source": "Mashable"
  },
  {
    "id": 12,
    "text": "Burnout Syndrome Stars Off Jumpol, Gun Atthaphan Address Use Of AI: ‘Pause And Think Before Trusting It’ (EXCLUSIVE). Burnout Syndrome Stars Off Jumpol, Gun Atthaphan Address Use Of AI: ‘Pause And Think Before Trusting It’ (EXCLUSIVE)mashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/entertainment/104174/burnout-syndrome-stars-off-jumpol-gun-atthaphan-address-use-of-ai-pause-and-think-before-trusting-it",
    "source": "Mashable"
  },
  {
    "id": 13,
    "text": "iPhone Fold design could be similar to Pixel 10 Pro Fold; YouTube video reveals. iPhone Fold design could be similar to Pixel 10 Pro Fold; YouTube video revealsmashable.com",
    "category": "entertainment",
    "url": "https://me.mashable.com/tech/65199/iphone-fold-design-could-be-similar-to-pixel-10-pro-fold-youtube-video-reveals",
    "source": "Mashable"
  },
  {
    "id": 14,
    "text": "Happy New Year 2026 greetings: Best AI prompts to personalise your NY wishes & thoughtful messages. Happy New Year 2026 greetings: Best AI prompts to personalise your NY wishes & thoughtful messagesmashable.com",
    "category": "entertainment",
    "url": "https://me.mashable.com/tech/65181/happy-new-year-2026-greetings-best-ai-prompts-to-personalise-your-ny-wishes-thoughtful-messages",
    "source": "Mashable"
  },
  {
    "id": 15,
    "text": "Apple Teases Major Fitness+ Update in 2026: What’s Coming. Apple Teases Major Fitness+ Update in 2026: What’s Comingmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104116/apple-teases-major-fitness-update-in-2026-whats-coming",
    "source": "Mashable"
  },
  {
    "id": 16,
    "text": "AI Prompts to Create Personalised New Year Wishes That Actually Feel Thoughtful. AI Prompts to Create Personalised New Year Wishes That Actually Feel Thoughtfulmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104114/ai-prompts-to-create-personalised-new-year-wishes-that-actually-feel-thoughtful",
    "source": "Mashable"
  },
  {
    "id": 17,
    "text": "How to Personalise New Year 2026 Stickers on WhatsApp: A Step-by-Step Guide. How to Personalise New Year 2026 Stickers on WhatsApp: A Step-by-Step Guidemashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104047/how-to-personalise-new-year-2026-stickers-on-whatsapp-a-step-by-step-guide",
    "source": "Mashable"
  },
  {
    "id": 18,
    "text": "OpenAI looks to hire a new Head of Preparedness to deal with AI's dangers. The move to hire for the role comes after multiple wrongful death lawsuits were filed against the ChatGPT maker.",
    "category": "entertainment",
    "url": "https://me.mashable.com/tech/65063/openai-looks-to-hire-a-new-head-of-preparedness-to-deal-with-ais-dangers",
    "source": "Mashable"
  },
  {
    "id": 19,
    "text": "Meet Jayshree Ullal: The Tech CEO Richer Than Microsoft's Satya Nadella and Google's Sundar Pichai. Meet Jayshree Ullal: The Tech CEO Richer Than Microsoft's Satya Nadella and Google's Sundar Pichaimashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104020/meet-jayshree-ullal-the-tech-ceo-richer-than-microsofts-satya-nadella-and-googles-sundar-pichai",
    "source": "Mashable"
  },
  {
    "id": 20,
    "text": "Google DeepMind Co-Founder, Shane Legg, Says AI Could End Remote Work. Google DeepMind Co-Founder, Shane Legg, Says AI Could End Remote Workmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/103994/google-deepmind-co-founder-shane-legg-says-ai-could-end-remote-work",
    "source": "Mashable"
  },
  {
    "id": 0,
    "text": "Fable: The First Preview. So far, Playground Games seems to understand the assignment in rebooting one of Xbox's most beloved franchises.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/fable-the-first-preview",
    "source": "IGN"
  },
  {
    "id": 1,
    "text": "How to Watch UFC 324: Stream Gaethje vs. Pimblett for Free in 2026. The Walmart+ workaround.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/how-to-watch-ufc-324-on-paramount-plus-for-free",
    "source": "IGN"
  },
  {
    "id": 2,
    "text": "Upcoming Nintendo Switch Games: Release Dates for 2026 and Beyond. Building up the Switch 2 library.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/all-upcoming-nintendo-switch-2-games",
    "source": "IGN"
  },
  {
    "id": 3,
    "text": "'Please Try to Be Friendly to Other Guests' – Arc Raiders Players Bombard Real-Life Stella Montis Hotel With 5-Star Reviews. Stella Montis is known for its cold, suffocating halls and cutthroat Raider encounters, but Arc Raiders players can’t get enough of the real-life Stella Montis hotel.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/please-try-to-be-friendly-to-other-guests-arc-raiders-players-bombard-real-life-stella-montis-hotel-with-5-star-reviews",
    "source": "IGN"
  },
  {
    "id": 4,
    "text": "Best Buy Has Open Box Asus ROG Zephyrus G14 RTX 5060 Gaming Laptops for Just $1,107. This gaming laptop can double as an ultra-portable 3.3-pound daily driver.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/best-buy-has-open-box-asus-rog-zephyrus-g14-rtx-5060-gaming-laptops-for-just-1107",
    "source": "IGN"
  },
  {
    "id": 5,
    "text": "Final Fantasy 7 Rebirth Card Game Queen's Blood Will be 'Enhanced' for FF7 Remake Part 3. Queen’s Blood fans, it's time to celebrate. The addictive Final Fantasy 7 Rebirth card game is making a “powered-up” comeback for the final chapter in Square Enix’s remake trilogy.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/final-fantasy-7-rebirth-card-game-queens-blood-will-be-enhanced-for-ff7-remake-part-3",
    "source": "IGN"
  },
  {
    "id": 6,
    "text": "The iBuypower Month End Clearance Sale Has Excellent Ready to Ship Gaming PC Deals. Get an RTX 5070 Ti or RX 9070 XT gaming PC with 3 year warranty for less than building one yourself.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/ibuypower-clearance-sale-ready-to-ship-gaming-pc-deals",
    "source": "IGN"
  },
  {
    "id": 7,
    "text": "The Game Awards Closer Highguard Reemerges With Launch Showcase — So Yes, It's Still Coming Out Next Week. Highguard has reemerged after going dark following its much-discussed reveal at the end of The Game Awards last month, with a launch showcase that reaffirms it really is coming out next week.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/the-game-awards-closer-highguard-reemerges-with-launch-showcase-so-yes-its-still-coming-out-next-week",
    "source": "IGN"
  },
  {
    "id": 8,
    "text": "James Gunn Reveals First Look at Jason Momoa's Lobo in Supergirl DC Teaser. We finally have our first look at Jason Momoa’s Lobo in a fresh teaser for DC Universe movie Supergirl.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/james-gunn-reveals-first-look-at-jason-momoas-lobo-in-supergirl-dc-teaser",
    "source": "IGN"
  },
  {
    "id": 9,
    "text": "Beneath the Trees Where Nobody Sees Sequel Reaches a Shocking Conclusion. IDW's cute but grisly horror series Beneath the Trees Where Nobody Sees: Rite of Spring took a shocking turn in its penultimate chapter. Check out an exclusive preview of the series finale.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/beneath-the-trees-where-nobody-sees-sequel-reaches-a-shocking-conclusion",
    "source": "IGN"
  },
  {
    "id": 10,
    "text": "Arknights: Endfield Launch Marks Franchise’s Debut on PC and Console. ",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/arknights-endfield-launch-marks-franchises-debut-on-pc-and-console",
    "source": "IGN"
  },
  {
    "id": 11,
    "text": "Here's How The Office's Michael Scott and Dwight Schrute Look in Fortnite. Fortnite fans have gainded a first look at how The Office characters Michael Scott and Dwight Scrute will appear in the game, when they become available later tonight.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/heres-how-the-offices-michael-scott-and-dwight-schrute-look-in-fortnite",
    "source": "IGN"
  },
  {
    "id": 12,
    "text": "Corsair’s Katar Pro XT Review: A Solid Wired Budget Mouse, but Its Exaggerated Egg Shape Feels Alien. Does Corsair's Katar Pro XT remain a worthy pick? This budget mouse is solidly built and has great clicks, but its shape isn't for everyone and other flaws lie under the surface.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/corsairs-katar-pro-xt-gaming-mouse-review",
    "source": "IGN"
  },
  {
    "id": 13,
    "text": "Em meio a críticas, Remedy defende exclusividade de Alan Wake 2 com “excelente parceira” Epic Games. “Não haveria Alan Wake 2 sem a Epic”",
    "category": "entertainment",
    "url": "https://br.ign.com/alan-wake-ii/150304/news/em-meio-a-criticas-remedy-defende-exclusividade-de-alan-wake-2-com-excelente-parceira-epic-games",
    "source": "IGN"
  },
  {
    "id": 14,
    "text": "Surprise Super Mario Galaxy Movie Nintendo Direct Announced for This Weekend. Here's hoping you didn't have anything else planned for your weekend, as Nintendo has announced a surprise Super Mario Galaxy Movie Nintendo Direct for this coming Sunday.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/surprise-super-mario-galaxy-movie-nintendo-direct-announced-for-this-weekend",
    "source": "IGN"
  },
  {
    "id": 15,
    "text": "Can Anyone Stop The Beauty's Ryan Murphy?. Can anyone stop Ryan Murphy? The multi-series producing powerhouse keeps making television like The Beauty… whether we like it or not.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/can-anyone-stop-the-beauty-ryan-murphy",
    "source": "IGN"
  },
  {
    "id": 16,
    "text": "'I Don't Like It. I Would Prefer That It Not Be Done' — Master Chief Actor Steve Downes Says Deceptive AI Reproductions of His Voice 'Cross a Line'. Steve Downes, the actor behind Master chief’s iconic voice, has said deceptive AI reproductions of his voice “cross a line that gets into an area I am uncomfortable with” — and he wants it to stop.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/i-dont-like-it-i-would-prefer-that-it-not-be-done-master-chief-actor-steve-downes-says-deceptive-ai-reproductions-of-his-voice-cross-a-line",
    "source": "IGN"
  },
  {
    "id": 17,
    "text": "'I've Never Seen It in Games Before' — Fable Will Use a Storytelling Technique Borrowed From The Office. Remember those mockumentary-style interview sections in the original reveal trailer for Fable? Well, those will actually be in the game, and they’re inspired by an unlikely source — The Office.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/ive-never-seen-it-in-games-before-fable-will-use-a-storytelling-technique-borrowed-from-the-office",
    "source": "IGN"
  },
  {
    "id": 18,
    "text": "'This is a New Chapter' — Spider-Man: Brand New Day Features a 'Tonal Shift' From Tom Holland's First Trilogy. Tom Holland's return in Spider-Man: Brand New Day will feature a \"tonal shift\" from the actors' first trilogy, director Destin Daniel Cretton has said.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/this-is-a-new-chapter-spider-man-brand-new-day-features-a-tonal-shift-from-tom-hollands-first-trilogy",
    "source": "IGN"
  },
  {
    "id": 19,
    "text": "Magic: The Gathering: Lorwyn Eclipsed is Out Today, Here's Where to Buy Everything From 2026's First Set. Lorwyn Eclipsed is Magic: The Gathering's first set of 2026, and it's out next week. Here's where to secure your preorders, and find the best price on boosters.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/magic-the-gathering-lorwyn-eclipsed-where-to-buy-updated-2026",
    "source": "IGN"
  },
  {
    "id": 20,
    "text": "Pokémon Day 2026 TCG Collection Is Back in Stock With a Major New Discount at Amazon. Ahead of Pokémon's 30th anniversary celebrations, the immensely popular Pokémon Day 2026 TCG Collection is back in stock at Amazon for $26.99, a major discount compared to its $60 market price right now.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/pokemon-day-2026-tcg-collection-is-back-in-stock-with-a-major-new-discount-at-amazon",
    "source": "IGN"
  },
  {
    "id": 21,
    "text": "'I Think It's F***ing Great' — Chris Pratt Has a 'Really Strong Vision' for Star-Lord's Future in the MCU and Has Pitched It to Marvel. Guardians of the Galaxy 3 ended with a clear message: Star-Lord / Peter Quill will return to the Marvel Cinematic Universe. But how, and when? Actor Chris Pratt has revealed he has pitched Marvel on his vision for the future of the character — and he certainl…",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/i-think-its-fing-great-chris-pratt-has-a-really-strong-vision-for-star-lords-future-in-the-mcu-and-has-pitched-it-to-marvel",
    "source": "IGN"
  },
  {
    "id": 22,
    "text": "The Pitt Season 2, Episode 3: \"9:00 A.M.\" Review. While certain characters are frustratingly relegated to the background in Episode 3, The Pitt still manages to entertain and enthrall in equal measure.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/the-pitt-season-2-episode-3-900-am-review-recap",
    "source": "IGN"
  },
  {
    "id": 23,
    "text": "Nintendo Switch 2 Was the Best-Selling Console of 2025 in the U.S. and Is Still Outselling the Nintendo Switch. The Nintendo Switch 2 was the best-selling console of 2025 in the U.S., both in unit sales and dollar sales, selling a total of 4.4 million units in the U.S, and continuing its streak of selling faster than the original Nintendo Switch.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/nintendo-switch-2-was-the-best-selling-console-of-2025-in-the-us-and-is-still-outselling-the-nintendo-switch",
    "source": "IGN"
  },
  {
    "id": 24,
    "text": "The Powerful 4K-Ready Skytech O11 Vision Radeon 9070 XT Gaming PC Drops to $1,597. The Radeon 9070 XT is comparable to the RTX 5070 Ti.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/skytech-o11-vision-radeon-9070-xt-gaming-pc-drops-to-1597",
    "source": "IGN"
  },
  {
    "id": 25,
    "text": "Today’s Top Deals: Save on a LEGO F1 Set, Premium Razer Gaming Headset, and Amazon Devices. That’s not all, as Samsung’s The Frame TVs, the Tom & Jerry Anthology, and plenty more items are on sale.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/best-deals-for-january-22-2026",
    "source": "IGN"
  },
  {
    "id": 26,
    "text": "Star Wars: Who's Who in the Maul - Shadow Lord Trailer. Who are all the characters in the Maul: Shadow Lord trailer? When does the new Star Wars series take place? We break down everything you need to know.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/star-wars-whos-who-in-the-maul-shadow-lord-trailer",
    "source": "IGN"
  },
  {
    "id": 27,
    "text": "Get a Pair of Open Box Apple AirPods Pro 2nd Gen Noise Canceling Earbuds for Just $109. Brand new, unused, and fully functional condition with 90-day warranty.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/apple-airpods-pro-deal-open-box-from-ebay",
    "source": "IGN"
  },
  {
    "id": 28,
    "text": "Forza Horizon 6: Here’s What Comes in Each Edition. Everything you need to know to preorder Forza Horizon 6 for Xbox or PC, including what comes in each edition, how much it costs, when it comes out, and more.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/forza-horizon-6-where-to-buy",
    "source": "IGN"
  },
  {
    "id": 29,
    "text": "The Kamrui Ryzen 7 6800H Micro PC with 32GB of DDR5 RAM, 512GB SSD, And Win11 Pro Drops to $359. About the size of a Mac Mini.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/kamrui-hyper-h1-micro-pc-deal-includes-cpu-ram-ssd-and-os",
    "source": "IGN"
  },
  {
    "id": 30,
    "text": "Pokémon TCG: Ascended Heroes Preorders Are Up at TCGplayer, Revealing the Latest Market Price Data for Sealed Products. ",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/pokemon-tcg-mega-evolution-ascended-heroes-sealed-products-are-up-for-preorder-at-tcgplayer",
    "source": "IGN"
  },
  {
    "id": 31,
    "text": "Beast of Reincarnation Game Director Says Game Freak's Primary Focus Is on 'Gameplay Experience' Rather Than Visual Fidelity or Graphics. We just got our first lengthy, proper look at Beast of Reincarnation, the upcoming game from Pokemon developer Game Freak that, at least based on what we saw today, seems to be their most ambitious non-Pokemon game yet. But as a Pokemon fan, that does leave m…",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/beast-of-reincarnation-game-director-says-game-freaks-primary-focus-is-on-gameplay-experience-rather-than-visual-fidelity-or-graphics",
    "source": "IGN"
  },
  {
    "id": 32,
    "text": "The Biggest Magic: The Gathering Crashers and Climbers This Week - January 22, 2026. Here are the biggest climbers and crashers in Magic: The Gathering to kick off 2026, including sought-after Stranger Things cards.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/the-biggest-magic-the-gathering-crashers-and-climbers-this-week-january-22-2026",
    "source": "IGN"
  },
  {
    "id": 33,
    "text": "Beast of Reincarnation Gets New Look at Action/RPG-Hybrid Combat and a Summer Release Window. During today's Xbox Developer Direct, Pokemon developer Game Freak arrived on the scene to give a lengthy new look at its new game, Beast of Reincarnation, alongside a narrowed release window: it's planned for release in summer of this year.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/beast-of-reincarnation-gets-new-look-at-actionrpg-hybrid-combat-and-a-summer-release-window",
    "source": "IGN"
  },
  {
    "id": 34,
    "text": "Expand Your Funko Pop Collection With New Lara Croft Figures, Now Available to Preorder. Two new Lara Croft Funko Pops - a \"Polygon\" figure and a \"The Angel of Darkness\" figure - are now available to preorder for $14.99 a piece. They're set to be released on March 22.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/where-to-buy-new-tomb-raider-lara-croft-funko-pop-figures",
    "source": "IGN"
  },
  {
    "id": 35,
    "text": "Pokémon TCG: Mega Evolution Phantasmal Flames Booster Bundles Just Drop To Its Lowest Price Ever at Amazon. Score a Pokémon TCG: Phantasmal Flames Booster Bundle at its lowest price ever at Amazon today.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/pokemon-tcg-mega-evolution-phantasmal-flames-booster-bundles-just-drop-to-its-lowest-price-ever-at-amazon",
    "source": "IGN"
  },
  {
    "id": 36,
    "text": "LIVE: Everything Announced at Xbox Developer Direct 2026. Everything announced at Xbox Developer Direct 2026, including all the trailers.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/xbox-developer-direct-2026-everything-announced",
    "source": "IGN"
  },
  {
    "id": 37,
    "text": "Metal Gear Solid Delta: Snake Eater for PS5 Is Down to $40 Right Now at Amazon. Metal Gear Solid Delta: Snake Eater for PS5 has been marked down to $39.98 at Amazon, a 43% discount from its original list price of $69.99.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/metal-gear-solid-delta-snake-eater-for-ps5-is-down-to-40-right-now-at-amazon",
    "source": "IGN"
  },
  {
    "id": 38,
    "text": "I Opened Up a Bunch of Handheld Gaming PCs to See Which Ones Are Easiest to Upgrade. Which handheld is easiest to upgrade the storage for? Well, I ripped them all apart to find out.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/i-opened-up-a-bunch-of-handheld-gaming-pcs-to-see-which-ones-are-easiest-to-upgrade",
    "source": "IGN"
  },
  {
    "id": 39,
    "text": "Now You Can Show Off Your Favorite* Pokémon On a Secretlab Titan Evo Gaming Chair. ",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/now-you-can-show-off-your-favorite-pokmon-on-a-secretlab-titan-evo-gaming-chair",
    "source": "IGN"
  },
  {
    "id": 40,
    "text": "Nintendo Announces Super Mario Bros. Wonder Switch 2 Edition Release Date, Plus Elephant Mario and Captain Toad Amiibo. Nintendo has just confirmed a release date for Super Mario Bros. Wonder's expanded Switch 2 Edition, which will include a suite of new minigames and the ability to play as Rosalina.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/nintendo-announces-super-mario-bros-wonder-switch-2-edition-release-date-plus-elephant-mario-and-captain-toad-amiibo",
    "source": "IGN"
  },
  {
    "id": 41,
    "text": "New League of Legends TCG Riftbound Has Posted Explosive Early Growth Since Launch, With Searches Surging Over 300%. According to new data from TCGplayer, daily searches for Riftbound, the new TCG from Riot Games, have increased by over 300% since launch.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/new-league-of-legends-tcg-riftbound-has-posted-explosive-early-growth-since-launch-with-searches-surging-over-300",
    "source": "IGN"
  },
  {
    "id": 42,
    "text": "Save on a Play Booster Box of Magic: The Gathering’s Most Underrated 2025 Set. Save 15% on a Play Booster box of Magic: The Gathering's Edge of Eternities set and secure some great sci-fi cards.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/save-on-a-play-booster-box-of-magic-the-gatherings-most-underrated-2025-set",
    "source": "IGN"
  },
  {
    "id": 43,
    "text": "'Miraculous': Beyond Good & Evil 2 Fans Can't Believe the Game Has Survived Ubisoft's Major Project Cull That Killed the Prince of Persia: Sands of Time Remake. Beyond Good & Evil 2 fans are celebrating a small piece of good news to come from Ubisoft's major cull of projects, studios and people yesterday — that after almost two decades, the game that holds the Guinness World Record for the longest development still i…",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/miraculous-beyond-good-evil-2-fans-cant-believe-the-game-has-survived-ubisofts-major-project-cull-that-killed-the-prince-of-persia-sands-of-time-remake",
    "source": "IGN"
  },
  {
    "id": 44,
    "text": "2026 Oscar Nominations: LIVE. 2026 Oscar Nominations Live Blog.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/2026-oscar-nominations-live",
    "source": "IGN"
  },
  {
    "id": 45,
    "text": "Ubisoft Says Prince of Persia: The Sands of Time Remake Needed 'More Time and Investment Than We Could Responsibly Commit,' 5 Years After it Was First Due to Launch. Ubisoft has said that completing its now-canceled Prince of Persia: Sands of Time remake would have \"required more time and investment than we could responsibly commit,\" despite more than half a decade of development.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/ubisoft-says-prince-of-persia-the-sands-of-time-remake-needed-more-time-and-investment-than-we-could-responsibly-commit-5-years-after-it-was-first-due-to-launch",
    "source": "IGN"
  },
  {
    "id": 46,
    "text": "Nintendo Updates Pokémon Legends Z-A to Version 2.0.1, Here Are The Full Patch Notes. Nintendo has released an update for Pokémon Legends: Z-A, with some handy item adjustments and a list of bug fixes for the game's Mega Dimension DLC.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/nintendo-updates-pokmon-legends-z-a-to-version-201-here-are-the-full-patch-notes",
    "source": "IGN"
  },
  {
    "id": 47,
    "text": "Warhammer 40,000: Space Marine 2's Upcoming Techmarine Class Has a Unique Ability That Has Fans Very Excited Indeed. Warhammer 40,000: Space Marine 2 will soon get the Techmarine, its seventh playable class, and with it comes a unique ability that sounds very exciting indeed.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/warhammer-40000-space-marine-2s-upcoming-techmarine-class-has-a-unique-ability-that-has-fans-very-excited-indeed",
    "source": "IGN"
  },
  {
    "id": 48,
    "text": "Mario Kart World Update 1.5.0 Released, Here Are the Full Patch Notes. There's a fresh update waiting for Nintendo Switch 2 launch title Mario Kart World, with a couple of tweaks and a list of bug fixes.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/mario-kart-world-update-150-released-here-are-the-full-patch-notes",
    "source": "IGN"
  },
  {
    "id": 49,
    "text": "'As Long as I'm Covered in Rubber, No One Will Know I'm Pissing My Pants' — 75-Year-Old Ron Perlman Says He's Still Ready to Do Hellboy 3. Ron Perlman has said he is still very interested in reprising his iconic role as Hellboy for Hellboy 3 and finishing Guillermo del Toro’s much-loved superhero trilogy — despite being 75 years old.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/as-long-as-im-covered-in-rubber-no-one-will-know-im-pissing-my-pants-75-year-old-ron-perlman-says-hes-still-ready-to-do-hellboy-3",
    "source": "IGN"
  },
  {
    "id": 0,
    "text": "Diabetes: AI model and blood test may identify risk sooner. Recent advances in diabetes detection may help to identify risk earlier. In this article, MNT discusses recent studies that suggest both an AI test and a blood test could help to highlight diabetes risk sooner than current methods.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/ai-platform-and-blood-test-may-better-predict-diabetes-risk",
    "source": "Medical News Today"
  },
  {
    "id": 1,
    "text": "Longevity: Can the shingles vaccine help slow down aging?. Older adults vaccinated against shingles appear to experience slower biological aging, according to a new study.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/shingles-vaccine-may-help-slow-biological-aging",
    "source": "Medical News Today"
  },
  {
    "id": 2,
    "text": "Heart failure: Medication text reminders improve treatment adherence. A new study suggests that receiving text-based 'nudges' could help remind patients to refill their prescriptions, which may also help to reduce readmission rates.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/text-reminders-may-help-heart-failure-patients-avoid-readmission",
    "source": "Medical News Today"
  },
  {
    "id": 3,
    "text": "Vascular dementia: Keeping weight in check may aid prevention. Obesity may increase a person's risk of vascular dementia by influencing factors such as blood pressure, a news study suggests.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/obesity-risk-factor-vascular-dementia",
    "source": "Medical News Today"
  },
  {
    "id": 4,
    "text": "Longevity: Mixing different physical activities may prolong life span. Regularly engaging in a variety of physical activities such as walking, cycling, and swimming, may be the best way to prolong life span, according to a study published in BMJ Medicine.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/types-physical-activity-help-prolong-life-span-longevity-exercise",
    "source": "Medical News Today"
  },
  {
    "id": 5,
    "text": "AI-ready database offers collaborative approach to cancer research. The Cancer Research Institute launches a first-of-its-kind open-access database to help scientists better understand how the immune system responds to cancer treatments over time. The collaborative approach aims to overcome a longstanding challenge in immunot…",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/ai-ready-open-database-aims-to-accelerate-cancer-immunotherapy-research",
    "source": "Medical News Today"
  },
  {
    "id": 6,
    "text": "Tylenol use in pregnancy does not cause autism, ADHD, review finds. There is no link between acetaminophen use in pregnancy and autism or ADHD risk for the offspring, a new gold-standard review of the evidence, conducted by researchers in Europe, concludes.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/gold-standard-review-denies-link-between-tylenol-pregnancy-autism-adhd-risk",
    "source": "Medical News Today"
  },
  {
    "id": 7,
    "text": "US vaccine guidelines: What do the changes mean for clinicians?. Recent changes to the national immunization schedules have raised questions and caused confusion that could complicate care decisions and coverage, but what do these changes mean for clinicians?",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/us-vaccine-changes-challenge-clinical-practice-insurance-coverage",
    "source": "Medical News Today"
  },
  {
    "id": 8,
    "text": "Aging muscles: How does exercise help prevent protein decline?. Scientists have discovered how exercise protects aging muscles by suppressing DEAF1, a molecule they identified as a driver of muscle decline.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/exercise-prevents-muscle-loss-aging-how-protein-biology",
    "source": "Medical News Today"
  },
  {
    "id": 9,
    "text": "To live longer, try cutting sitting time down by 30 minutes. As little as 5 extra minutes of moderate-to-vigorous physical activity each day could help prevent 6% of deaths among those who are the least active, a large new study has found.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/moving-just-5-more-minutes-each-day-could-boost-longevity",
    "source": "Medical News Today"
  },
  {
    "id": 10,
    "text": "New AI platform could help more cancer patients access clinical trials. Researchers at Mount Sinai launch a new AI platform to match more cancer patients with clinical trials, aiming to expand enrolment.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/mount-sinai-ai-tool-aims-to-improve-access-to-cancer-clinical-trials",
    "source": "Medical News Today"
  },
  {
    "id": 11,
    "text": "Type 2 diabetes: Timing or type of menopause does not affect risk. The timing or type of menopause does not impact the risk of developing type 2 diabetes but certain health and lifestyle factors may, a new study finds.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/early-menopause-not-linked-higher-type-2-diabetes-risk",
    "source": "Medical News Today"
  },
  {
    "id": 12,
    "text": "Dementia: HRT for menopause does not increase risk. Hormone replacement therapy (HRT) to treat menopause symptoms does not increase dementia risk, according to a new study.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/hrt-does-not-increase-dementia-risk-in-women",
    "source": "Medical News Today"
  },
  {
    "id": 13,
    "text": "Chat GPT Health: Expert take on AI’s role in modern medicine. Following the release of ChatGPT Health, due to an increased interest in AI-driven medical guidance, MNT discusses the role of AI health advice with AI-in-clinical-medicine expert David Liebovitz.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/is-chatgpt-health-the-future-of-ai-medical-advice",
    "source": "Medical News Today"
  },
  {
    "id": 14,
    "text": "Prostate cancer: Simple tool may help to spot metastatic cancer sooner. University Hospitals Seidman Cancer Center researchers have developed a tool that could identify metastatic prostate cancer earlier. This tool may help guide treatment, such as signalling when to intervene, intensify treatment, or enrol in trials.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/new-tool-can-help-identify-metastatic-prostate-cancer-risk-earlier",
    "source": "Medical News Today"
  },
  {
    "id": 15,
    "text": "Hypertension: More beige fat linked to better blood pressure control. Scientists have found that beige fat, unlike white fat, may actually help control blood pressure, via a study in mice, which could lead to new treatments for hypertension.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/beige-fat-may-help-regulate-blood-pressure-mice-study",
    "source": "Medical News Today"
  },
  {
    "id": 16,
    "text": "Crohn's disease: Low-calorie, plant-based diet may help. A form of very low-calorie fasting-mimicking diet may help alleviate symptoms of mild-to-moderate Crohn's disease.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/fasting-mimicking-diet-may-help-with-crohns-disease",
    "source": "Medical News Today"
  },
  {
    "id": 17,
    "text": "Type 2 diabetes, cancer: Common food preservatives may heighten risk. A number of commonly used food preservatives were linked to a higher risk of type 2 diabetes and many forms of cancer in two new studies from the same team.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/food-preservatives-linked-to-type-2-diabetes-and-cancer-studies-warn",
    "source": "Medical News Today"
  },
  {
    "id": 18,
    "text": "Food pyramid gets review with new US 2026 dietary guidelines. The new U.S. dietary guidelines call for prioritizing high-quality protein, healthy fats, and avoiding sugars and processed foods. Here's what experts think of these changes.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/4-key-changes-us-dietary-guidelines-prioritize-protein-full-fat-dairy",
    "source": "Medical News Today"
  },
  {
    "id": 19,
    "text": "Diabetes, kidney disease: Light exercise may help lower death risk. Light physical activity may help lower death risk in cardiovascular-kidney-metabolic syndrome, a condition that includes heart disease, kidney disease, obesity, and type 2 diabetes.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/walking-house-chores-may-help-lower-diabetes-heart-disease-death-risk",
    "source": "Medical News Today"
  },
  {
    "id": 20,
    "text": "Heart disease: High cholesterol linked to increased 30-year risk. A new study found that having higher lipoprotein(a) levels was linked to an increased 30-year risk for cardiovascular disease, even in healthy women.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/high-cholesterol-predict-future-heart-disease-risk-lipoprotein-healthy-women",
    "source": "Medical News Today"
  },
  {
    "id": 21,
    "text": "Supercentenarians: How can you live past 110?. Brazil holds a record number of supercentenarians, people who live healthy lives past 110. What is the secret to their longevity",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/many-brazilians-live-past-110-what-are-their-secrets",
    "source": "Medical News Today"
  },
  {
    "id": 22,
    "text": "Can exercise treat depression just as well as therapy?. Getting enough exercise, especially light to moderate intensity, may help reduce depression symptoms as effectively as psychological therapy, a new study suggests.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/exercise-may-reduce-depression-symptoms-as-effectively-as-therapy",
    "source": "Medical News Today"
  },
  {
    "id": 23,
    "text": "Blue Monday: Let us lay this mental health myth to rest. Blue Monday, the most depressing day of the year: Is there any science behind it, or is it just a myth that has gained too much momentum over time?",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/mental-health-myth-blue-monday-depression-sad-january",
    "source": "Medical News Today"
  },
  {
    "id": 24,
    "text": "Vascular dementia: Scientists find way to restore brain blood flow. Scientists have found that adding a missing phospholipid back into the bloodstream might help improve blood flow and reduce the symptoms of dementia, which could lead to a new treatment.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/restoring-missing-lipid-ease-vascular-dementia-damage-brain-study",
    "source": "Medical News Today"
  },
  {
    "id": 25,
    "text": "Alzheimer's: Experimental treatment restores memory in mice. A new drug candidate shows promise by reversing cognitive decline in advanced Alzheimer's disease by restoring brain balance in an animal study.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/experimental-drug-reverses-alzheimers-in-mice",
    "source": "Medical News Today"
  },
  {
    "id": 26,
    "text": "ADHD: Common Medications May Work Differently Than Previously Believed. A new study suggests that common medications prescribed to help manage ADHD, such as Adderall and Ritalin, may work differently than believed.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/adhd-stimulants-dont-work-the-way-we-thought-they-did",
    "source": "Medical News Today"
  },
  {
    "id": 27,
    "text": "Dementia: Disturbances to circadian rhythm may increase risk. The results of a recent study suggest that people with a weaker or more irregular body clock, also known as circadian rhythm, may have a higher risk of developing dementia.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/body-clock-disturbances-may-contribute-to-dementia-risk-evidence-suggests",
    "source": "Medical News Today"
  },
  {
    "id": 28,
    "text": "Colorectal cancer: 10-12 minute bursts of exercise may halt growth. A short burst of intense exercise — as little as 10 to 12 minutes — may be able to provide benefits such as slowing the growth of colorectal cancer cells, a new study has found.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/10-minutes-intense-exercise-may-treat-prevent-colorectal-cancer",
    "source": "Medical News Today"
  },
  {
    "id": 29,
    "text": "Breast cancer: Hot flash drug slows tumor growth even at low doses. Megestrol, which helps treat hot flashes associated with menopause, may have the added benefit of slowing the growth of ER-positive breast tumors, a new trial has found.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/hot-flash-treatment-menopause-slow-breast-cancer-growth-trial-megestrol-letrozole",
    "source": "Medical News Today"
  },
  {
    "id": 30,
    "text": "FDA approves first pill for weight loss: 5 things to know. MNT speaks with three obesity medicine experts to find out more about the FDA-aproved Wegovy pill and how it's different from the Wegovy injection.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/wegovy-weight-loss-pill-comparison-injections-side-effects-contraindications",
    "source": "Medical News Today"
  },
  {
    "id": 31,
    "text": "Dementia: 3 reasons poor sleep may increase risk. Medical News Today looks at three key studies and their key findings that highlight and further confirm the connection between how poor sleep increases dementia risk.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/sleep-quality-insomnia-sleep-apnea-increase-dementia-risk-latest-evidence",
    "source": "Medical News Today"
  },
  {
    "id": 32,
    "text": "Heart health: Should you get your B12 from diet or supplements?. Vitamin B12 is a vital nutrient that plays numerous key roles in maintaining health. It is available in different forms and can be found in both food and supplements. A recent review suggests that the natural version could be more beneficial.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/diet-vs-supplements-which-b12-form-is-better-for-health",
    "source": "Medical News Today"
  },
  {
    "id": 33,
    "text": "'Dry January': Can 1 month of no alcohol have a real effect on health?. Abstaining from alcohol for just one month as part of 'Dry January' can offer meaningful physical and psychological improvements, including better sleep, and weight loss, a new study confirms.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/dry-january-1-month-no-alcohol-difference-health-study",
    "source": "Medical News Today"
  },
  {
    "id": 34,
    "text": "Could these 7 behaviors help extend lifespan after a cancer diagnosis?. A study has found that people exercise regularly, quit smoking, and practice five other health strategies can improve their chances of living longer after cancer.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/7-heart-healthy-behaviors-help-increase-longevity-after-cancer",
    "source": "Medical News Today"
  },
  {
    "id": 35,
    "text": "Brain aging: Creative pursuits may help support brain health. Research suggests that individuals who partake in creative activities, such as arts and crafts, musical instruments, and gardening, typically have a more youthful brain on average.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/dancing-reading-and-video-games-could-help-delay-brain-aging",
    "source": "Medical News Today"
  },
  {
    "id": 36,
    "text": "Could probiotics help manage and prevent eczema and acne?. A review indicates that probiotic, prebiotic, and synbiotic supplements could be beneficial for skin health, especially for managing conditions such as eczema.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/supplements-that-support-gut-health-may-also-benefit-skin-health",
    "source": "Medical News Today"
  },
  {
    "id": 37,
    "text": "How much coffee should you drink for a long, healthy life?. Coffee may boost longevity and lower diabetes risk according to the latest research. Here is what the evidence tells us.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/roundup-coffee-and-longevity-3-studies-explore-how-coffee-may-benefit-healthy-aging",
    "source": "Medical News Today"
  },
  {
    "id": 38,
    "text": "Chronic pain: 5 healthy habits linked to 8 years younger brain. A few simple, healthy habits have been linked to 8 years younger brain, even in people with chronic pain.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/5-healthy-habits-may-help-keep-the-brain-younger-even-with-chronic-pain",
    "source": "Medical News Today"
  },
  {
    "id": 39,
    "text": "Anxiety, depression: Less social media use can improve symptoms. Recent research shows that reducing social media use for at least one week can lower rates of anxiety, depression, and insomnia in young adults.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/1-week-social-media-break-could-boost-mental-health",
    "source": "Medical News Today"
  },
  {
    "id": 40,
    "text": "Dementia: Driving habits could be a marker of brain health. Can driving patterns help predict cognitive decline later in life? A new study finds that certain changes in driving habits may point to mild cognitive impairment.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/changes-driving-patterns-predict-cognitive-decline-dementia",
    "source": "Medical News Today"
  },
  {
    "id": 41,
    "text": "Cardiovascular disease: How eating takeout may heighten risk. Research suggests a link between dietary plans high in takeout food and systemic inflammation. A new study highlights that those who eat greater amounts of takeout food are more likely to have elevated risk factors for heart disease.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/eating-takeout-too-often-may-increase-cardiovascular-risk",
    "source": "Medical News Today"
  },
  {
    "id": 42,
    "text": "Sleep vs exercise: How to strike the balance for health. Sleep is as important as exercise for health, new research emphasizes, advising that we first need proper rest in order to improve our physical activity.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/between-sleep-and-exercise-choose-sleep-research-suggests",
    "source": "Medical News Today"
  },
  {
    "id": 0,
    "text": "Russia's bombardment of Ukrainian urban infrastructure intensifies. Kyiv's mayor, Vitali Klitschko has urged people to leave the city if they have somewhere else to go while the freezing conditions last. We hear from a resident of Kharkhiv in eastern Ukraine after overnight strikes on the city.\n\nAlso on the programme: Under a…",
    "category": "health",
    "url": "https://www.bbc.co.uk/programmes/w172zssjx156wcx",
    "source": "BBC News"
  },
  {
    "id": 1,
    "text": "Ely's Men Walking and Talking mental health group to expand. The founder of a mental health network's only group in Cambridgeshire is planning more events.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c17z8gggy17o",
    "source": "BBC News"
  },
  {
    "id": 2,
    "text": "Scafell Pike hikers left Wasdale rescue team to pay hotel bill. The mountain rescue team says it feels obliged to settle the debt on their behalf.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c9vx0jrnmejo",
    "source": "BBC News"
  },
  {
    "id": 3,
    "text": "Protest in the age of the 'Kill Switch'. In the face of widespread protests, the Iranian government ‘switched off’ the country’s access to the internet on 8th January. In Uganda, prior to recent elections, the government of president Yoweri Museveni prevented its citizens from accessing the internet…",
    "category": "health",
    "url": "https://www.bbc.co.uk/programmes/p0mwrggp",
    "source": "BBC News"
  },
  {
    "id": 4,
    "text": "5 Live Sport: All About... Australian Open. Gigi, Russell and Pat Cash review the action from day seven of the Australian Open.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mwy9d6",
    "source": "BBC News"
  },
  {
    "id": 5,
    "text": "Stevenage leader says scrapping election will avoid waste. The government confirms there will be no elections this year in Stevenage and Welwyn Hatfield.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c20ggxdg9wyo",
    "source": "BBC News"
  },
  {
    "id": 6,
    "text": "NHS cancer gene database to allow families to check risk. Thousands of people in England will be able to check whether they have genes linked to cancer.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c62v7l4v7gro",
    "source": "BBC News"
  },
  {
    "id": 7,
    "text": "Police officers to be told they must get work licence or face dismissal. The plans are part of a raft of measures aimed at the reform of police forces in England and Wales.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cn0kelpx734o",
    "source": "BBC News"
  },
  {
    "id": 8,
    "text": "Donald Trump sparks outrage over Nato troops claim. World leaders and army veterans have rejected President Trump's claim that Nato service personnel did not fight on the front lines or play a key part during the US-led war in Afghanistan. We speak to a former secretary general of Nato, whose alliance sent tho…",
    "category": "health",
    "url": "https://www.bbc.co.uk/programmes/w172zssjx154yfv",
    "source": "BBC News"
  },
  {
    "id": 9,
    "text": "Post Office and Fujitsu accused of delaying £4m damages claim. Lee Castleton is taking legal action against his former employer over the Horizon IT scandal.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cgk82743gz1o",
    "source": "BBC News"
  },
  {
    "id": 10,
    "text": "Hundreds of Minnesota businesses close to protest ICE presence. Thousands of people have joined widespread protests against the weeks-long immigration crackdown in the state.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c1dk67g4q91o",
    "source": "BBC News"
  },
  {
    "id": 11,
    "text": "The News Quiz: Ep2. U-Turn, We Defect. Andy’s returned from The Ashes and is back in the News Quiz chair. He’s come home to a selection of defections, some serious U-turning and 30,000 properties without water in his hometown of Tunbridge Wells. He was only away for one week! Helping Andy make sen…",
    "category": "health",
    "url": "https://www.bbc.co.uk/programmes/p0mv42f2",
    "source": "BBC News"
  },
  {
    "id": 12,
    "text": "South Sudan army chief gives soldiers seven days to crush rebellion. Reinforcements are sent to the town of Bor, a strategic staging post on the way to the capital, Juba.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cj0nn0dvg6jo",
    "source": "BBC News"
  },
  {
    "id": 13,
    "text": "Are ICE immigration agents acting outside the law?. Immigration raids in Minneapolis are dividing America",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8bz1",
    "source": "BBC News"
  },
  {
    "id": 14,
    "text": "Politics Show: Sarwar’s QEUH claims, assisted dying and ‘Salmond files’. David Wallace Lockhart, Lynsey Bews and Natalie Higgins on the week’s political news.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mws7b7",
    "source": "BBC News"
  },
  {
    "id": 15,
    "text": "Three-way talks between the US, Russia and Ukraine to start. The first three-way talks between the US, Russia and Ukraine are due to be held later today. It's a new development - but will it bring peace closer?\n \nSenior officials from all three nations are involved, but it is unclear whether they will be in the same ro…",
    "category": "health",
    "url": "https://www.bbc.co.uk/programmes/w172zssjx15436y",
    "source": "BBC News"
  },
  {
    "id": 16,
    "text": "Philip Young pleads guilty to drugging and raping ex-wife. Philip Young admitted a number of offences, which allegedly cover a 13-year period.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c4grr3368n3o",
    "source": "BBC News"
  },
  {
    "id": 17,
    "text": "Tesla fined for repeatedly failing to help UK police over driving offences. The British arm of Tesla has faced multiple court proceedings linked to allegations of road traffic offences.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c0r44zpprg7o",
    "source": "BBC News"
  },
  {
    "id": 18,
    "text": "Australian Open Daily: Is British tennis punching below its weight?. Gigi, Russell and Dan Kiernan round up day six of the Australian Open.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mws5sh",
    "source": "BBC News"
  },
  {
    "id": 19,
    "text": "Health board denials 'severely impacted' hospital inquiry - lawyer. The former first minister's remarks came as oral submissions ended in the inquiry into the design and construction of Scotland's largest hospital.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/clynny0x5yro",
    "source": "BBC News"
  },
  {
    "id": 20,
    "text": "Greenland: What natural resources does the island have?. Greenland's natural resources include large reserves of rare earth deposits.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cly9230yw15o",
    "source": "BBC News"
  },
  {
    "id": 21,
    "text": "White House defends sharing AI image showing arrested woman crying. Latest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/live/ce9yydgmzdvt",
    "source": "BBC News"
  },
  {
    "id": 22,
    "text": "Wes Streeting says he will meet Hull father over diabetes appeal. John Story says he is \"cautiously optimistic\" the health secretary will stay true to his word.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c98ppz5n3jvo",
    "source": "BBC News"
  },
  {
    "id": 23,
    "text": "Trump's claim that Nato troops avoided Afghanistan front line 'disappointing and wrong', minister says. Veterans and bereaved families call the comments insulting and wrong, with Conservative Party leader Kemi Badenoch labelling them \"flat-out nonsense\".",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/live/cdxjjwjvkkzt",
    "source": "BBC News"
  },
  {
    "id": 24,
    "text": "Heathrow scraps 100ml liquid container limit. Heathrow says it has become the biggest airport to drop the limit after rolling out new high-tech scanners.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c1evvx89559o",
    "source": "BBC News"
  },
  {
    "id": 25,
    "text": "US officially leaves World Health Organization. Trump ordered the withdrawal a year ago, accusing the UN agency of failing to adopt reforms and mishandling the pandemic.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cn9zznx8qdno",
    "source": "BBC News"
  },
  {
    "id": 26,
    "text": "Listen: Hearts v Celtic dominates weekend preview. Looking ahead to the weekend fixtures. With Charlotte Cohen, Joelle Murray and Rory Loy",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mwp6pl",
    "source": "BBC News"
  },
  {
    "id": 27,
    "text": "Ukraine, Russia and US to hold trilateral talks in Abu Dhabi - live updates. The discussions in the United Arab Emirates follow a high-level meeting in Moscow between President Putin and a US delegation including Steve Witkoff.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/live/cz6yyy07wnjt",
    "source": "BBC News"
  },
  {
    "id": 28,
    "text": "The Wayne Rooney Show. Wayne discusses some of the most memorable matches from his career.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mtpx0m",
    "source": "BBC News"
  },
  {
    "id": 29,
    "text": "Russia, Ukraine and US to hold trilateral talks in Abu Dhabi. The meeting between the three countries comes as both Ukraine and Russia say no peace deal can be reached until territorial issues are resolved.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cx20011w4zzo",
    "source": "BBC News"
  },
  {
    "id": 30,
    "text": "Trump withdraws Canada's invite to join Board of Peace. Trump did not provide a reason for the decision, which comes after Canada's PM Mark Carney warned of a \"rupture\" in the US-led global order.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cn7jjp8gl0jo",
    "source": "BBC News"
  },
  {
    "id": 31,
    "text": "Capita-run civil service pension scheme leaves retirees in limbo. Civil service pension scheme failed to pay some pensions and lump sums after transferring to a new administrator.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cp9jkdx1gp8o",
    "source": "BBC News"
  }
]