[
  {
    "id": 0,
    "text": "BYD weighs India expansion as hundreds of car orders pile up. The discussions highlight both the opportunity and the regulatory hurdles BYD faces in one of the world’s fastest-growing auto markets",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-28/byd-weighs-india-expansion-as-hundreds-of-car-orders-pile-up",
    "source": "Bloomberg"
  },
  {
    "id": 1,
    "text": "India could order more homegrown reactors as nuclear push grows. India has opened up its nuclear sector to private companies, thanks to a new law passed in December — a significant boost to its ambition to build 100 gigawatts of nuclear capacity by 2047",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-28/india-could-order-more-homegrown-reactors-as-nuclear-push-grows",
    "source": "Bloomberg"
  },
  {
    "id": 2,
    "text": "India offers EU auto quota six times larger than UK deal. The larger allocation reflects the bloc’s much bigger auto market and will benefit manufacturers including Volkswagen AG, Mercedes-Benz Group AG, Stellantis NV and Renault SA",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-27/india-offers-eu-auto-quota-six-times-larger-than-uk-deal",
    "source": "Bloomberg"
  },
  {
    "id": 3,
    "text": "China’s Moonshot unveils new AI model ahead of DeepSeek release. The model, known as K2.5, joins a flurry of upgrades rolled out over the past month, reflecting a rush by China’s biggest AI players to get in ahead of the next unveiling by DeepSeek",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-27/china-s-moonshot-unveils-new-ai-model-ahead-of-deepseek-release",
    "source": "Bloomberg"
  },
  {
    "id": 4,
    "text": "China starts world’s largest compressed-air power storage plant. They work by pumping compressed air into underground caverns at night, for release during the day to spin turbines and produce electricity",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-27/china-starts-world-s-largest-compressed-air-power-storage-plant",
    "source": "Bloomberg"
  },
  {
    "id": 5,
    "text": "OPEC+ may stick with supply pause in March. OPEC+ plans to maintain oil production levels in March amid global surplus and geopolitical challenges, according to delegates.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-26/opec-likely-to-stick-with-supply-pause-in-march-delegates-say",
    "source": "Bloomberg"
  },
  {
    "id": 6,
    "text": "LNG buyers including Gail India Ltd. and Bharat Petroleum Corp stall deals as they await record supply wave. Indian LNG buyers delay contracts seeking lower prices amid anticipated supply surge, impacting energy goals and market dynamics.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-26/india-s-lng-buyers-stall-deals-as-they-await-record-supply-wave",
    "source": "Bloomberg"
  },
  {
    "id": 7,
    "text": "China to open up nickel and lithium futures to foreign investors. China is the world’s largest buyer of raw materials, but benchmark prices are mainly set in financial centers like London, Singapore and New York",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-26/china-to-open-up-nickel-and-lithium-futures-to-foreign-investors",
    "source": "Bloomberg"
  },
  {
    "id": 8,
    "text": "Hindustan Zinc becomes India’s most valuable metals firm on back of silver rally. Hindustan Zinc becomes India’s top metals firm as silver prices surge, with shares rising over 6% and year-to-date gains surpassing 15%.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-23/silver-boom-makes-hindustan-zinc-most-valuable-india-metals-firm",
    "source": "Bloomberg"
  },
  {
    "id": 9,
    "text": "India’s economic activity picks pace in January, flash PMI shows. “Despite the rise in the manufacturing PMI, January’s figure remained below the 2025 average,” Pranjul Bhandari, chief India economist at HSBC",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-23/india-s-economic-activity-picks-pace-in-january-flash-pmi-shows",
    "source": "Bloomberg"
  },
  {
    "id": 10,
    "text": "Weak rupee forces India to scrap South American soy oil shipments. India has canceled soybean oil shipments from South America as a weak rupee and high global prices make imports costly, boosting palm oil demand.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-23/india-scraps-more-south-american-soy-oil-cargoes-as-rupee-slumps",
    "source": "Bloomberg"
  },
  {
    "id": 11,
    "text": "Trump’s tariffs do bite — When he actually imposes them. The withdrawal this week of a proposed charge on European nations over Greenland is the latest example of how Trump sometimes wields the tariff weapon without firing it; And the number of unrealised threats is stacking up",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/trump-s-tariffs-do-bite-when-he-actually-imposes-them",
    "source": "Bloomberg"
  },
  {
    "id": 12,
    "text": "Former Citigroup banker draws $2 billion for Nexedge Capital in India. Anirudha Taparia founded Nexedge Capital less than a year ago and has hired 60 bankers so far, with another 30 expected to join in the next few month",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-23/former-citigroup-banker-draws-2-billion-for-new-india-firm",
    "source": "Bloomberg"
  },
  {
    "id": 13,
    "text": "SEC seeks fresh pathway to advance in stalled Adani fraud case. The SEC’s lawsuit, filed in November 2024, alleges that Gautam and Sagar Adani violated US securities laws by making false and misleading representations about Adani Green Energy Ltd",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/sec-seeks-fresh-pathway-to-advance-in-stalled-adani-fraud-case",
    "source": "Bloomberg"
  },
  {
    "id": 14,
    "text": "Gold pares losses after Goldman raises year-end price forecast. Goldman Sachs lifts its year-end gold price forecast to $5,400 an ounce from a previous estimate of $4,900, citing intensifying demand from private investors and central banks",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/gold-falls-after-trump-backs-away-from-tariffs-over-greenland",
    "source": "Bloomberg"
  },
  {
    "id": 15,
    "text": "Tata set to invest $11 billion in Maharashtra AI innovation city. The positioning of Innovation City adjacent to the Navi Mumbai airport, a landmark project developed by the Adani Group, is expected to create a powerful synergy between global transit and high-tech industry",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/tata-set-to-invest-11-billion-in-maharashtra-ai-innovation-city",
    "source": "Bloomberg"
  },
  {
    "id": 16,
    "text": "‘This time is different’: How AI is redefining the memory market. AI is revolutionizing the memory market, leading to elevated valuations and persistent demand for memory and storage stocks.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/-this-time-is-different-how-ai-is-redefining-the-memory-market",
    "source": "Bloomberg"
  },
  {
    "id": 17,
    "text": "Air India braces for record $1.6 billion loss after deadly crash in Ahmedabad last year. The losses come on the back of a turbulent year for Indian aviation marked by flier anxiety, flight delays and mass cancellations by a rival carrier that has put a spotlight on the duopolistic market structure",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/air-india-braces-for-record-1-6-billion-loss-after-deadly-crash",
    "source": "Bloomberg"
  },
  {
    "id": 18,
    "text": "China’s bumper silver exports belie market fears of curbs. China transitioned to license-only management from a quota system seven years ago, leading to silver exports rising in all but one year, primarily due to increased non-ferrous refining capacity where silver is a by-product",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/china-s-bumper-silver-exports-bely-market-fear-of-restrictions",
    "source": "Bloomberg"
  },
  {
    "id": 19,
    "text": "Sun Pharma is said to mull bid for women’s wellness firm Organon. Sun Pharma is exploring a potential bid for women's wellness firm Organon, but no final decision has been made.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-22/sun-pharma-is-said-to-mull-bid-for-women-s-wellness-firm-organon",
    "source": "Bloomberg"
  },
  {
    "id": 20,
    "text": "Netflix amends Warner Bros deal to all cash in bidding war. Netflix has shifted to an all-cash bid, removing its stock component.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/netflix-sweetens-warner-bros-terms-to-all-cash-in-bidding-war",
    "source": "Bloomberg"
  },
  {
    "id": 21,
    "text": "Trump says Powell’s life ‘won’t be happy’ if he stays at Fed. Trump also said his search for a new Fed chair is nearing completion, with contenders including Rick Rieder, Kevin Hassett, Christopher Waller and Kevin Warsh",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/trump-warns-powell-won-t-be-very-happy-if-he-stays-on-at-fed",
    "source": "Bloomberg"
  },
  {
    "id": 22,
    "text": "Gurman Scoops ‘Campos’, Apple’s Codename for a Chatbot-Based Siri in Next Year’s Version 27 OSes. ",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/ios-27-apple-to-revamp-siri-as-built-in-iphone-mac-chatbot-to-fend-off-openai?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc2OTAyNDk2NywiZXhwIjoxNzY5NjI5NzY3LCJhcnRpY2xlSWQiOiJUOFRXOVlLR0NURlUwMCIsImJjb25uZWN0SWQiOiJDNEVEQ0FFMUZBMDU0MEJFQTI0QTlGMjExQzFFOTA4MCJ9.awOoIDGdEkCAvho8waoXR6VVVojI3jGvQHJeDjwcyrs",
    "source": "Bloomberg"
  },
  {
    "id": 23,
    "text": "AP may explore legal curbs on social media use by children under 16. Technology and Human Resources Minister Nara Lokesh said young users lack the ability to fully grasp online content, calling for a strong legal framework.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/andhra-pradesh-mulling-australia-like-under-16-social-media-ban-nara-lokesh",
    "source": "Bloomberg"
  },
  {
    "id": 24,
    "text": "Air quality spike reduces consumer demand, affects retail growth: Shoppers Stop. Air quality in the Delhi region reached record highs, with around 90% of days above an AQI of 300, far exceeding the acceptable standard of 50 set by the US EPA.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/department-store-chain-cites-india-air-pollution-as-sales-stall",
    "source": "Bloomberg"
  },
  {
    "id": 25,
    "text": "India beefing up space-based surveillance after border conflict. India plans to launch over 50 spy satellites and add night-time imaging to enhance its national security capabilities, people familiar with the matter said, after New Delhi encountered surveillance blind spots during a border conflict last year with neighbor …",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/india-beefing-up-space-based-surveillance-after-border-conflict",
    "source": "Bloomberg"
  },
  {
    "id": 26,
    "text": "EU ‘fully prepared’ to hit back over Trump’s Greenland tariffs. The European Union is ready to strike back at Donald Trump over his tariff threats as he seeks to take Greenland, European Commission President Ursula von der Leyen said, toughening her rhetoric against the US president.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/eu-fully-prepared-to-hit-back-over-trump-s-greenland-tariffs",
    "source": "Bloomberg"
  },
  {
    "id": 27,
    "text": "JPMorgan UK unit to open branch in Gujarat’s Gift City. The branch will be facilitating the trading of equities, derivatives and other financial instruments",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/jpmorgan-uk-unit-to-open-branch-in-india-s-gift-city",
    "source": "Bloomberg"
  },
  {
    "id": 28,
    "text": "Reliance tumbles into deepest oversold level in years. The selloff has erased about $29 billion from the company’s market value so far in 2026",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-21/india-s-reliance-tumbles-into-deepest-oversold-level-in-years",
    "source": "Bloomberg"
  },
  {
    "id": 29,
    "text": "Real estate giant K Raheja eyes $700 million IPO. K Raheja Corp plans a $700 million IPO, potentially becoming India's largest real estate listing amid robust market activity.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/india-property-developer-k-raheja-said-to-weigh-700-million-ipo",
    "source": "Bloomberg"
  },
  {
    "id": 30,
    "text": "Tata Motors eyes bid for 6,000 e-buses without joining price wars. Tata Motors Ltd is preparing to bid for a government tender of as many as 6,000 electric buses, as it seeks to claw back market share without joining the steep discounting that has defined recent auctions, its top official said.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/tata-eyes-bid-for-6-000-e-buses-without-joining-price-wars",
    "source": "Bloomberg"
  },
  {
    "id": 31,
    "text": "India allows some exports of wheat products after three-year ban. India’s decision to restart some exports, which were halted in May 2022, coincides with the country’s trade talks with the US",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/india-allows-some-exports-of-wheat-products-after-three-year-ban",
    "source": "Bloomberg"
  },
  {
    "id": 32,
    "text": "The list of people invited to Trump’s Board of Peace for Gaza. Trump wants the signing ceremony to take place in Davos on Thursday, despite calls from some of those invited to rewrite the terms of the panel",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/the-list-of-people-invited-to-trump-s-board-of-peace-for-gaza",
    "source": "Bloomberg"
  },
  {
    "id": 33,
    "text": "Silver hits record high as US-EU crisis over Greenland simmers. The US’s aggression toward its NATO allies has rattled markets, buoying demand for havens and reviving the ‘Sell America’ trade",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/silver-rises-to-record-as-us-eu-tensions-over-greenland-persist",
    "source": "Bloomberg"
  },
  {
    "id": 34,
    "text": "RBI needs to ramp up bond purchases to cool yields, funds say. RBI has injected a record 14.5 trillion rupees of liquidity since end-December 2024 through cash reserve-ratio cuts, open-market bond purchases and foreign-exchange swaps,",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/rbi-needs-to-ramp-up-bond-purchases-to-cool-yields-funds-say",
    "source": "Bloomberg"
  },
  {
    "id": 35,
    "text": "EU eyes tariffs on €93 billion of US goods over Trump’s latest 10% levy threat. The European Union is in talks to potentially impose tariffs on €93 billion ($108 billion) of US goods if President Donald Trump follows through on his threat to hit European countries with a 10 per cent levy on Feb. 1.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/eu-eyes-tariffs-on-93-billion-of-us-goods-over-new-trump-threat",
    "source": "Bloomberg"
  },
  {
    "id": 36,
    "text": "Jane Street’s India unit saw trading gains soar 494% before curbs. The financial results cast new light on the scale of Jane Street’s trading operations in India, where the company is currently facing investigations by the stock market regulator.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/jane-street-india-unit-saw-trading-gains-soar-494-before-curbs",
    "source": "Bloomberg"
  },
  {
    "id": 37,
    "text": "Govt green-lights plan to buy 114 French Rafale jets. The purchase would be a significant upgrade for the Indian Air Force, whose fighter fleet, largely of Russian origin, is dwindling",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-16/india-inches-closer-to-buying-114-french-rafale-jets",
    "source": "Bloomberg"
  },
  {
    "id": 38,
    "text": "Walmart’s CEO of international business to depart company. Walmart's international CEO, Kathryn McLay, is stepping down; a successor will be named soon as leadership transitions.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-15/walmart-says-its-international-ceo-is-leaving-company",
    "source": "Bloomberg"
  },
  {
    "id": 39,
    "text": "Mitsubishi to buy Aethon US gas assets in $5.2 billion deal. Mitsubishi acquires Aethon Energy's US gas assets for $5.2 billion, marking a major investment in American shale.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-16/mitsubishi-to-buy-us-gas-assets-from-aethon-in-5-2-billion-deal",
    "source": "Bloomberg"
  },
  {
    "id": 40,
    "text": "Global corporate bond yield premiums fall to lowest since 2007. Money managers have been diving into the rally in credit due to the prospects of interest-rate cuts by the Federal Reserve and some other central banks",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-16/global-corporate-bond-yield-premiums-fall-to-lowest-since-2007",
    "source": "Bloomberg"
  },
  {
    "id": 41,
    "text": "Silver dips after US tariff pause, but set for hefty weekly gain. Silver prices dip after the US pauses tariffs but still achieve a significant weekly gain amid high demand.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-15/silver-dips-after-us-pause-on-critical-minerals-import-tariff",
    "source": "Bloomberg"
  },
  {
    "id": 42,
    "text": "Tesla’s India letdown spurs discounts on unsold Model Y SUVs. The tepid India debut comes at a time when the company is seeing faltering global demand. Its worldwide sales fell in 2025 for a second consecutive year, dropping the company behind China’s BYD Co. as the top-seller of EVs.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/tesla-s-india-letdown-spurs-discounts-on-unsold-model-y-suvs",
    "source": "Bloomberg"
  },
  {
    "id": 43,
    "text": "China bans cybersecurity products from top US, Israeli firms. Chinese companies’ use of such products could result in sensitive data being sent overseas or create other vulnerabilities for customers, says government directive",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/china-bans-cyber-products-from-top-us-israeli-security-firms",
    "source": "Bloomberg"
  },
  {
    "id": 44,
    "text": "US visa crackdown: A list of the 75 countries affected. US suspends immigrant visa processing for 75 countries starting January 21, intensifying its immigration crackdown.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-15/here-s-the-list-of-75-countries-affected-by-us-visa-crackdown",
    "source": "Bloomberg"
  },
  {
    "id": 45,
    "text": "US set to suspend visa processing for dozens of countries. While citizens of Afghanistan, Iran, Russia and Somalia already have little chance of getting a US visa, the move is likely to shut the door for people from nations such as Brazil",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/us-freezes-visa-processing-for-dozens-of-countries-fox-reports",
    "source": "Bloomberg"
  },
  {
    "id": 46,
    "text": "Bitcoin rally sees $600 million in bearish crypto bets wiped out. Bitcoin slumped to a loss of more than 6% for 2025 after ending the year in muted fashion, trading in a narrow range and proving largely indifferent to rallies in stocks and precious metals",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/bitcoin-btc-claims-two-month-high-of-over-96-000-on-macro-tailwinds",
    "source": "Bloomberg"
  },
  {
    "id": 47,
    "text": "Aluminium, copper settle after bull run into 2026. Aluminium and copper prices stabilize after a bullish run, amid concerns over demand and geopolitical risks impacting the metals market.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-13/aluminum-near-record-high-and-tin-extends-surge-on-supply-angst",
    "source": "Bloomberg"
  },
  {
    "id": 48,
    "text": "GA-backed Acko eyes banks for $350 million IPO. Acko is expected to appoint advisers in the coming weeks, they said. Deliberations are ongoing and the terms of the potential offering could still change",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-13/ga-backed-acko-said-to-seek-banks-for-350-million-india-ipo",
    "source": "Bloomberg"
  },
  {
    "id": 49,
    "text": "China examines foreign ETF trades after Jane Street India probe. China is investigating foreign ETF trades by Jane Street following regulatory issues in India, prompting UBS to pause some transactions.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-13/china-examines-foreign-etf-trades-after-jane-street-india-probe",
    "source": "Bloomberg"
  },
  {
    "id": 0,
    "text": "‘Inside Trump’s Head-Spinning Greenland U-Turn’. ",
    "category": "business",
    "url": "https://www.wsj.com/politics/national-security/a-piece-of-ice-for-world-protection-trump-demands-europe-cut-deal-on-greenland-cc1014f6?st=2XDhnR",
    "source": "The Wall Street Journal"
  },
  {
    "id": 1,
    "text": "Study Concludes That Americans Are the Ones Paying for Tariffs. ",
    "category": "business",
    "url": "https://www.wsj.com/economy/trade/americans-are-the-ones-paying-for-tariffs-study-finds-e254ed2e?st=pw4q2j",
    "source": "The Wall Street Journal"
  },
  {
    "id": 2,
    "text": "Micron to Buy Taiwan Plant for $1.8 Billion. The Boise, Idaho-based company plans to acquire the Taiwanese chip-making site to meet surging demand for memory-storage products.",
    "category": "business",
    "url": "https://www.wsj.com/business/deals/micron-to-buy-taiwan-plant-for-1-8-billion-5eef73e5",
    "source": "The Wall Street Journal"
  },
  {
    "id": 3,
    "text": "S&P 500 Slips After Bank Earnings. Stocks were lower after more bank earnings rolled in.",
    "category": "business",
    "url": "https://www.wsj.com/finance/u-s-futures-fall-precious-metals-gain-on-iranian-unrest-d8a82a84",
    "source": "The Wall Street Journal"
  },
  {
    "id": 4,
    "text": "Jamie Dimon Warns Political Interference With Fed Would Push Up Rates. The JPMorgan chief reiterated his support of the Fed after the DOJ investigation.",
    "category": "business",
    "url": "https://www.wsj.com/economy/central-banking/jamie-dimon-warns-political-interference-with-fed-would-push-up-rates-60ccfed6",
    "source": "The Wall Street Journal"
  },
  {
    "id": 5,
    "text": "Dow Futures Inch Down Ahead of Inflation Data, Bank Earnings. U.S. stock futures inched lower amid bank earnings and ahead of inflation data.",
    "category": "business",
    "url": "https://www.wsj.com/finance/global-markets-mixed-as-investors-await-u-s-inflation-print-a1c75430",
    "source": "The Wall Street Journal"
  },
  {
    "id": 6,
    "text": "What 10% Credit-Card Rate Cap Would Mean for Your Wallet. President Trump’s call for a cap promises to save Americans billions in interest but also can lead to tightened access to credit.",
    "category": "business",
    "url": "https://www.wsj.com/personal-finance/credit/what-a-10-credit-card-rate-cap-would-mean-for-your-wallet-365f2f8d",
    "source": "The Wall Street Journal"
  },
  {
    "id": 7,
    "text": "China Has Been Gorging on Black-Market Oil. That’s Now Getting Harder.. The official market for crude could soon start to feel disturbances as the U.S. and Europe crack down on illicit trading.",
    "category": "business",
    "url": "https://www.wsj.com/business/energy-oil/china-has-been-gorging-on-black-market-oil-thats-now-getting-harder-3b5e1f0c",
    "source": "The Wall Street Journal"
  },
  {
    "id": 8,
    "text": "Jim Moylan and the Moylan Arrow. ",
    "category": "business",
    "url": "https://www.wsj.com/business/autos/ford-gas-arrow-inventor-jim-moylan-6b2ef066?st=uhr6ym&reflink=desktopwebshare_permalink",
    "source": "The Wall Street Journal"
  },
  {
    "id": 9,
    "text": "China’s EV dominance at home is squeezing out foreign armakers. China’s electrification trend helped local brands take nearly two-thirds of the country’s passenger-car market.",
    "category": "business",
    "url": "https://www.wsj.com/business/autos/china-auto-sales-slump-amid-slowing-demand-379e7c92",
    "source": "The Wall Street Journal"
  },
  {
    "id": 10,
    "text": "Shell Flags Weak Oil-Trading Performance. Shell warned that a weak oil-trading performance would weigh on its earnings, compounding what is shaping up to be a challenging period as prices continue to...",
    "category": "business",
    "url": "https://www.wsj.com/business/energy-oil/shell-expects-higher-oil-and-gas-production-but-flags-downstream-weakness-613ad4bd",
    "source": "The Wall Street Journal"
  },
  {
    "id": 11,
    "text": "Stocks Mixed While Oil Futures Decline. The Dow industrials crept higher, edging toward the 50,000-point milestone, while the Nasdaq composite and S 500 were close to flat.",
    "category": "business",
    "url": "https://www.wsj.com/finance/stocks/global-markets-u-s-futures-nervy-as-geopolitical-tensions-sour-sentiment-c3bed2c2",
    "source": "The Wall Street Journal"
  },
  {
    "id": 12,
    "text": "Copper Extends Rally, Bursting Through $13,000 a Ton. The rally has been driven by concerns over tightening supply and tariff uncertainty in the U.S.",
    "category": "business",
    "url": "https://www.wsj.com/finance/commodities-futures/copper-extends-rally-bursting-through-13-000-a-ton-9e66c958",
    "source": "The Wall Street Journal"
  },
  {
    "id": 13,
    "text": "Energy & Utilities Roundup: Market Talk. Find insight on U.S. Gulf Coast refiners, Chevron, Adani Power and more in the latest Market Talks covering Energy and Utilities.",
    "category": "business",
    "url": "https://www.wsj.com/business/energy-utilities-roundup-market-talk-de2813fc",
    "source": "The Wall Street Journal"
  },
  {
    "id": 14,
    "text": "Lululemon Founder Chip Wilson Launches Proxy Fight to Change Board. The founder’s proposal seeks to make boardroom revisions before the athletic-apparel company chooses a new CEO.",
    "category": "business",
    "url": "https://www.wsj.com/business/lululemon-activist-investor-campaign-70c61e8e",
    "source": "The Wall Street Journal"
  },
  {
    "id": 0,
    "text": "22 Pictures That Prove Trump Has No Idea What’s Actually Happening At Protests. \"You can't have guns. You can't walk in with guns. You just can't.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/mjs538/protest-pictures-through-the-years",
    "source": "Buzzfeed"
  },
  {
    "id": 1,
    "text": "11 Times Celebrities Were Accused Of Being “Rude” Or “Stuck-Up” On Red Carpets, Vs. What Exactly Went Down. Some celebrities have even responded to viral discourse around their behavior.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/rudest-celebrity-red-carpet-moments",
    "source": "Buzzfeed"
  },
  {
    "id": 2,
    "text": "\"I Was A Different Person For About Two Years Post-Partum\": Women Are Revealing The \"Ugly\" Parts Of Pregnancy That Aren’t Well Known. \"The first 10 days postpartum were harder than my entire pregnancy and birth combined...\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/angelicaamartinez/dark-sides-of-pregnancy-reddit",
    "source": "Buzzfeed"
  },
  {
    "id": 3,
    "text": "Married Women Are Confessing The Hardest Parts Of Marriage That No One Ever Talks About. \"I married a man who turned out to be a helpless child who couldn't do anything for himself. I felt like his cook, housekeeper, secretary, bookkeeper, mother, and personal assistant rolled into one.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/lizmrichardson/married-women-share-hardest-parts-of-marriage",
    "source": "Buzzfeed"
  },
  {
    "id": 4,
    "text": "Servers And Other Restaurant Workers Are Revealing The Customer Behaviors That Make Them Want To Tear Their Hair Out, So Stop Doing Them!!!!!!!. \"Guests who blow their nose in our linen napkins and then leave it on the table for us to pick up.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/hannahdobro/ways-to-instantly-annoy-your-server",
    "source": "Buzzfeed"
  },
  {
    "id": 5,
    "text": "Trump Supporters Who Finally \"Woke Up\" From The MAGA Cult In 2026 Are Revealing Their Last Straw. \"Trump's America is not the America that I took an oath to defend with my life. It is embarrassing, and I feel lost because of what we let him devolve us into.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/morgansloss1/former-trump-supporters-reveal-why-they-left-maga",
    "source": "Buzzfeed"
  },
  {
    "id": 6,
    "text": "Here's How Americans Are Showing Up For Each Other All Over The Country. \"We survive by holding each other up.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/bellaarnold/moments-of-togetherness-ice-protests",
    "source": "Buzzfeed"
  },
  {
    "id": 7,
    "text": "Even Some Republicans Are Criticizing The Trump Administration Over Federal Agents Killing Alex Pretti. You know things aren't great when even Ted Cruz has some qualms...View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/natashajokic1/trump-gop-alex-pretti-shooting",
    "source": "Buzzfeed"
  },
  {
    "id": 8,
    "text": "What has been the most helpful way to deal with anxiety (besides therapy and medicine)?. If you made some big lifestyle changes or found the inner mantra that always brings you peace of mind, I want to hear about it!View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/joyfullegend494/helpful-anxiety-methods-dq",
    "source": "Buzzfeed"
  },
  {
    "id": 9,
    "text": "A Pot Roast Caused This Family To Implode, And Here's The Viral Takeaway That Is Causing People To Rethink Everything. \"We have confused 'giving our children everything' with 'giving them ourselves.' We have replaced time with tablets and discipline with negotiation. We are so afraid of being the bad guys that we are raising a generation that doesn't know how to be good peopl…",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/kristatorres/grandma-facebook",
    "source": "Buzzfeed"
  },
  {
    "id": 10,
    "text": "Here's The Alleged Condition That Would Reconcile Victoria Beckham, David Beckham, And Brooklyn Beckham. Plus: New reports on the seemingly never-ending feud between Victoria and Nicola Peltz.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/larryfitzmaurice/what-would-end-beckham-family-feud-reports",
    "source": "Buzzfeed"
  },
  {
    "id": 11,
    "text": "People Are Pointing Out One Big \"Lie\" In This \"Melania\" The Movie Tweet. A box office event for all of the wrong reasons.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/mjs538/melania-movie",
    "source": "Buzzfeed"
  },
  {
    "id": 12,
    "text": "Couples Are Confessing The *Extremely* Adorable Ways They Met, And I’m Melting Into A Frickin' Puddle Over Here. These stories are what movies are made of.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/jennifer_mcphee/adorable-meet-cute-stories",
    "source": "Buzzfeed"
  },
  {
    "id": 13,
    "text": "19 Breakup Stories That Will Make You Want To Delete The Dating Apps And Adopt 17 Cats Instead. \"Turns out, my partner had gotten a new car, a new home, broken our lease, had a move-out date, and I was the last to know.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/hannahdobro/worst-breakup-stories-will-make-you-cringe",
    "source": "Buzzfeed"
  },
  {
    "id": 14,
    "text": "People Can't Help But Call Out Conservatives As This Pic Of MAGA Protesters With Guns Resurfaced Online. The standard keeps shifting.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alexalisitza/viral-reddit-photo-armed-maga-protesters",
    "source": "Buzzfeed"
  },
  {
    "id": 15,
    "text": "\"Just One Atrocity After Another Being Committed By This Gang\": Jimmy Kimmel Appeared Visibly Emotional While Denouncing ICE. \"Let's cut the bull**** already.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/natashajokic1/jimmy-kimmel-ice-monologue-alex-pretti",
    "source": "Buzzfeed"
  },
  {
    "id": 16,
    "text": "Locals, what's a common mistake tourists make in your country/city?. Yes, we can spot you from a mile away.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/hannahloewentheil/tourist-mistakes-while-traveling-dq",
    "source": "Buzzfeed"
  },
  {
    "id": 17,
    "text": "The People Who Poorly Designed These 22 Things Need To Issue A Refund IMMEDIATELY. These designers are FRAUDS.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/ajanibazile/dangerous-designs-jan-2026",
    "source": "Buzzfeed"
  },
  {
    "id": 18,
    "text": "“My Breasts Literally Could Not Handle What Were Put In Me”: Amelia Gray Hamlin Detailed What Happened After Her Breast Augmentation Went Horrifically Wrong. “I was dating somebody who was older than me when I was younger, and I sort of allowed his beauty perception to affect my choices.”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/amelia-gray-hamlin-recalls-breast-surgery-complications",
    "source": "Buzzfeed"
  },
  {
    "id": 19,
    "text": "Here’s How Martha Stewart Responded When Her 14-Year-Old Granddaughter Called Out Her Silence On The ICE Killings. “Her generation gives me hope.”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/martha-stewart-granddaughter-calls-out-silence-ice-killings",
    "source": "Buzzfeed"
  },
  {
    "id": 20,
    "text": "\"Now I Understand Why Older Guys Would Be Violently Shaking Their Junk At Urinals...:\" – 18 Adult Problems People Were NOT Prepared For. \"Chores are an inescapable loop.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/bendzialdowski/adult-problems",
    "source": "Buzzfeed"
  },
  {
    "id": 21,
    "text": "Top Upcoming Concerts In 2026 You Can’t Miss. From BTS to TWICE, here’s a list of who’s coming to a town near you.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/bfeedasia/top-upcoming-concerts-in-2026-you-cant-miss",
    "source": "Buzzfeed"
  },
  {
    "id": 22,
    "text": "\"Trump Is Just A Symptom\" — People Are Sharing What They Think The US Will Be Like After Trump's Second Term. \"Every term ends the same way: different faces, same cycle.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/scarymouse/opinions-what-the-us-america-look-like-after-trump",
    "source": "Buzzfeed"
  },
  {
    "id": 23,
    "text": "\"This Is Such A Specific American Way Of Thinking\": Non-Americans Are Calling Out Billie Eilish For Centering Celebrities In Light Of ICE Activity And The Recent Murders In Minnesota. \"If law enforcement were killing people on the streets in England and people were bringing up Adele in the conversation instead of law makers, I would lose it. No way that's what you're thinking about rn...\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/angelicaamartinez/billie-eilish-calls-out-celebs-politics-social-media",
    "source": "Buzzfeed"
  },
  {
    "id": 24,
    "text": "People Are Calling This Resurfaced Video Of Alex Pretti Giving A Final Tribute To His Patient \"Haunting\" And \"Heartbreaking\". \"Today, we remember that freedom is not free. We have to work at it, nurture it, protect it, and even sacrifice for it.\" —Alex PrettiView Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alanavalko/alex-pretti-veteran-final-words-video",
    "source": "Buzzfeed"
  },
  {
    "id": 25,
    "text": "18 Questions About Home Design That Are A Complete And Total Giveaway To How Old You Are. You hate to say it, but this quiz is pretty accurate.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/audreyworboys/questions-guess-your-age-home-design",
    "source": "Buzzfeed"
  },
  {
    "id": 26,
    "text": "\"MAGA Went From 'Teachers Should Be Required To Carry Guns' To 'Carrying A Gun Makes You A Criminal' In Record Time\": People Are Calling Out Conservatives For Completely Abandoning Their Beliefs. \"MAGA went from 'teachers should be required to carry guns' to 'carrying a gun makes you a criminal' in record time.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/morgansloss1/maga-gun-double-standards-criticized-alex-pretti-shooting",
    "source": "Buzzfeed"
  },
  {
    "id": 27,
    "text": "\"I Was Having A Great Day Until I Learned About Tongue Cribs\": If You Were A Thumb Sucker As A Kid, You May Need One Of These Horrifying Dental Contraptions. \"The most barbaric form of braces I've ever seen.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/kristatorres/tongue-cribs-thumb-sucking-tiktok",
    "source": "Buzzfeed"
  },
  {
    "id": 28,
    "text": "Sydney Sweeney Allegedly Climbed The Hollywood Sign For A Lingerie Promo, And It's Getting Messy. This might be the messiest lingerie promo yet...View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/trendyghost618/sydney-sweeney-allegedly-vandalized-the-hollywood-sign",
    "source": "Buzzfeed"
  },
  {
    "id": 29,
    "text": "\"I Tell Everyone To Watch It Now\": 21 Movies That Went Straight Over Your Head As A Child. \"Once I had gone through some things myself, I was able to fully appreciate the film.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/trendyghost618/21-movies-youll-see-differently-when-youre-older",
    "source": "Buzzfeed"
  },
  {
    "id": 30,
    "text": "People Are Calling JD Vance A \"Morally Repulsive\" \"Sick F–ck\" For His Comments On Alex Pretti. JD Vance whined about protesters demonstrating outside of a restaurant where ICE agents ate.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alexalisitza/jd-vances-alex-pretti-tweet-response",
    "source": "Buzzfeed"
  },
  {
    "id": 31,
    "text": "\"I Now Live With A Shadow Of Shame\": These 31 Hilarious Fails From Last Week Will Make You Laugh So Hard You'll Forget About The State Of The World Right Now. Happy 0th birthday, I guess?View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/kelley_greene/best-internet-fails-from-this-week-01-26-26",
    "source": "Buzzfeed"
  },
  {
    "id": 32,
    "text": "\"I'm Not Asking For Sympathy\": Kanye West Has Apologized For His Antisemitic Remarks. \"I am not a Nazi or an antisemite. I love Jewish people.”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/larryfitzmaurice/kanye-west-antisemitism-apology-wall-street-journal",
    "source": "Buzzfeed"
  },
  {
    "id": 33,
    "text": "\"F–ckers\": Thousands Of People Are Stunned By This 1 Very Specific Anti-ICE Protest Sign. We need your thoughts on this very pointed anti-ICE protest sign.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alexalisitza/viral-anti-ice-sign",
    "source": "Buzzfeed"
  },
  {
    "id": 34,
    "text": "What's something that was supposed to be a \"phase\" but absolutely wasn't?. Your random hobby, your comfort show, your weird obsession — yeah, it stayed.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alpacagalore/not-a-phase-community-dq",
    "source": "Buzzfeed"
  },
  {
    "id": 35,
    "text": "Marcello Hernández Credited Black Culture For Gen Z Slang On \"SNL\", And Good On Him For Saying The Quiet Part Out Loud. Because Black uncles have been saying \"cooked\" for ages.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/jadagomez/marcello-hernandez-snl-black-culture-gen-z-slang",
    "source": "Buzzfeed"
  },
  {
    "id": 36,
    "text": "People Are Seriously Divided Over Jason Segel’s Confession That He Pranked His Mom With His “Forgetting Sarah Marshall” Nude Scene. “men really do live on another planet because in what world is ‘pranking’ your mother by not telling her she’s about to see your genitalia in a public space a funny bit???”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/stephaniesoteriou/jason-segel-mom-walk-out-tears-nude-scene-reactions",
    "source": "Buzzfeed"
  },
  {
    "id": 37,
    "text": "27 Stylish Pieces You’ll Want If You’re Trying To Dress Less Boring. If your outfits have been feeling very \"meh\" lately, this post is for you.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/melanie_aman/stylish-statement-pieces",
    "source": "Buzzfeed"
  },
  {
    "id": 38,
    "text": "48 Things For Anyone Tired Of Having A Boring Living Room. As if I could have finished this post without adding some new Heated Rivalry home decor.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/malloryannp/things-anyone-tired-of-boring-living-room",
    "source": "Buzzfeed"
  },
  {
    "id": 39,
    "text": "33 Things To Keep Your Feline-Filled Household Running Smoothly. Oh Feliway diffuser, how grateful I am to you for your cat-calming powers. View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/jenae_sitzes/cat-products-to-keep-household-running-smoothly",
    "source": "Buzzfeed"
  },
  {
    "id": 40,
    "text": "34 Valentine's Day Gifts For Couples Who've Been Together So Long That They've Run Out Of Gifts To Get Each Other. Including a personalized love letter blanket, a dual showerhead (let's make tandem showers a thing), chili crisp chocolate, and more heartwarming and cute gift ideas for your cutie.",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/melanie_aman/valentines-gifts-for-established-couples",
    "source": "Buzzfeed"
  },
  {
    "id": 41,
    "text": "If You’re A Quick Learner, Here Are 54 DIY Upgrades You Can Make To Your Home. Go ahead and use all this indoor time to knock some stuff off your to-do list.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/elizabethlilly/if-youre-a-quick-learner-here-are-diy-home-upgrades-2026",
    "source": "Buzzfeed"
  },
  {
    "id": 42,
    "text": "\"My Wife Has Shocked Me In The Last Couple Of Years\": 12 Stories By People Whose Friends And Family Unexpectedly Shifted To The Right. \"My brother fell down the alt-right pipeline during COVID. He had always considered himself to be fairly middle of the road until he started listening to Joe Rogan.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/ajanibazile/people-shifting-conservative",
    "source": "Buzzfeed"
  },
  {
    "id": 43,
    "text": "25 Products That’ll Take Your Kitchen From Clutter City To Tidy Town. Do yourself a favor and grab one of these container lid organizers. In the wise words of one reviewer, \"Life is too short to be fighting with lids.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/karlyjacklin/products-to-tidy-cluttered-kitchen",
    "source": "Buzzfeed"
  },
  {
    "id": 44,
    "text": "26 Products That’ll Make People Think You Live A Luxe Life, But Really You’re Just Good At Buying Nice-Looking Inexpensive Things. Living a luxe life shouldn't mean having to pay luxury prices — thankfully, these products are here to prove that.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/samanthawieder/luxe-life-products-an",
    "source": "Buzzfeed"
  },
  {
    "id": 45,
    "text": "If You’re In Your “Cozy Era,” These 34 Products Are Here To Help. Not even a stupid Canadian wolf bird could ruin these cozy vibes.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/danielboan/products-for-your-cozy-era",
    "source": "Buzzfeed"
  },
  {
    "id": 46,
    "text": "22 Affordable Lingerie Finds To Make It Look Like You Spent Way More Than You Actually Did. Aka pieces that'll scream \"serious luxury\" whether you're into cozy comfort or \"AWOOGA\" level spice.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/negestikaudo/affordable-lingerie-finds-an",
    "source": "Buzzfeed"
  },
  {
    "id": 47,
    "text": "Choose Your Favorite Animals And We'll Reveal Which Flower Represents Your Aura. Is your vibe elegant and mysterious like a rose, or cheerful and laid-back like a daisy?View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/gryffinpuff20/everyone-has-a-flower-that-matches-their-aura-pic",
    "source": "Buzzfeed"
  },
  {
    "id": 48,
    "text": "\"I Know What I Saw\": People Are Sharing The Wildest Things They've Ever Witnessed. \"Everyone says I'm lying. I'm not.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/victoriavouloumanos/people-sharing-wildest-things-theyve-ever-witnessed",
    "source": "Buzzfeed"
  },
  {
    "id": 49,
    "text": "These Stories Of People Walking In On Their Partners Cheating Will Make You Want To Stay Single Forever. \"She was pregnant with my husband's baby when we were moving out of state at the end of that year.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/aronawriting/cheating-exes-stories-flipped",
    "source": "Buzzfeed"
  },
  {
    "id": 0,
    "text": "Apple AirTag Gets Its Biggest Upgrade Yet With Longer Range And Louder Speaker: Check India Price. Apple AirTag Gets Its Biggest Upgrade Yet With Longer Range And Louder Speaker: Check India Pricemashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/105088/apple-airtag-gets-its-biggest-upgrade-yet-with-longer-range-and-louder-speaker-check-india-price",
    "source": "Mashable"
  },
  {
    "id": 1,
    "text": "Realme 16 Pro Plus Review: Big Camera Energy, Familiar Realme Feel. Realme 16 Pro Plus Review: Big Camera Energy, Familiar Realme Feelmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/105011/realme-16-pro-plus-review-big-camera-energy-familiar-realme-feel",
    "source": "Mashable"
  },
  {
    "id": 2,
    "text": "Biggest iPhone Upgrade in Years? iPhone 18 Pro Leaks Reveal New Chip and Staggered Launch. Biggest iPhone Upgrade in Years? iPhone 18 Pro Leaks Reveal New Chip and Staggered Launchmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/105002/biggest-iphone-upgrade-in-years-iphone-18-pro-leaks-reveal-new-chip-and-staggered-launch",
    "source": "Mashable"
  },
  {
    "id": 3,
    "text": "Apple Could Turn Siri Into Full AI Chatbot With iOS 27 Update, Challenging ChatGPT. Apple Could Turn Siri Into Full AI Chatbot With iOS 27 Update, Challenging ChatGPTmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104985/apple-could-turn-siri-into-full-ai-chatbot-with-ios-27-update-challenging-chatgpt",
    "source": "Mashable"
  },
  {
    "id": 4,
    "text": "TikTok is rolling out a new age-detection system in the EU. TikTok is rolling out a new age-detection system in the EUmashable.com",
    "category": "entertainment",
    "url": "https://sea.mashable.com/tech/41684/tiktok-is-rolling-out-a-new-age-detection-system-in-the-eu",
    "source": "Mashable"
  },
  {
    "id": 5,
    "text": "Apple MacBook Pro M5 and M5 Max MacBook Pro tipped to launch on January 28; Here’s all you need to know. Apple MacBook Pro M5 and M5 Max MacBook Pro tipped to launch on January 28; Here’s all you need to knowmashable.com",
    "category": "entertainment",
    "url": "https://me.mashable.com/tech/65879/apple-macbook-pro-m5-and-m5-max-macbook-pro-tipped-to-launch-on-january-28-heres-all-you-need-to-kno",
    "source": "Mashable"
  },
  {
    "id": 6,
    "text": "3 things 'The Pitt' episode '8:00 AM' gets right about AI in medicine, and 1 big thing it gets wrong. 3 things 'The Pitt' episode '8:00 AM' gets right about AI in medicine, and 1 big thing it gets wrongmashable.com",
    "category": "entertainment",
    "url": "https://me.mashable.com/tech/65823/3-things-the-pitt-episode-800-am-gets-right-about-ai-in-medicine-and-1-big-thing-it-gets-wrong",
    "source": "Mashable"
  },
  {
    "id": 7,
    "text": "Grok Says It Has Restricted Image Generation To Subscribers After Deepfake Concerns. But Has It?. Grok Says It Has Restricted Image Generation To Subscribers After Deepfake Concerns. But Has It?mashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104511/grok-says-it-has-restricted-image-generation-to-subscribers-after-deepfake-concerns-but-has-it",
    "source": "Mashable"
  },
  {
    "id": 8,
    "text": "Google Makes Gemini 3 AI Tools Free on Gmail, Sundar Pichai Reveals Big Update. Google Makes Gemini 3 AI Tools Free on Gmail, Sundar Pichai Reveals Big Updatemashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104469/google-makes-gemini-3-ai-tools-free-on-gmail-sundar-pichai-reveals-big-update",
    "source": "Mashable"
  },
  {
    "id": 9,
    "text": "WhatsApp Group Chats Are Getting a Big Upgrade: Here’s What’s New. WhatsApp Group Chats Are Getting a Big Upgrade: Here’s What’s Newmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104408/whatsapp-group-chats-are-getting-a-big-upgrade-heres-whats-new",
    "source": "Mashable"
  },
  {
    "id": 10,
    "text": "Samsung Galaxy S26 Ultra to Feature Apple-Like Design Tweaks: What to Expect. Samsung Galaxy S26 Ultra to Feature Apple-Like Design Tweaks: What to Expectmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104226/samsung-galaxy-s26-ultra-to-feature-apple-like-design-tweaks-what-to-expect",
    "source": "Mashable"
  },
  {
    "id": 11,
    "text": "Vijay Sales Apple Days Sale Ending Soon: Get Upto ₹ 20,000 Discount On iPhone 17 Pro Max, iPhone 16 And More. Vijay Sales Apple Days Sale Ending Soon: Get Upto ₹ 20,000 Discount On iPhone 17 Pro Max, iPhone 16 And Moremashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104190/vijay-sales-apple-days-sale-ending-soon-get-upto-rs-20000-discount-on-iphone-17-pro-max-iphone-16-an",
    "source": "Mashable"
  },
  {
    "id": 12,
    "text": "Apple Vision Pro is failing. Here's why that matters.. Apple Vision Pro is failing. Here's why that matters.mashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104182/apple-vision-pro-is-failing-heres-why-that-matters",
    "source": "Mashable"
  },
  {
    "id": 13,
    "text": "Burnout Syndrome Stars Off Jumpol, Gun Atthaphan Address Use Of AI: ‘Pause And Think Before Trusting It’ (EXCLUSIVE). Burnout Syndrome Stars Off Jumpol, Gun Atthaphan Address Use Of AI: ‘Pause And Think Before Trusting It’ (EXCLUSIVE)mashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/entertainment/104174/burnout-syndrome-stars-off-jumpol-gun-atthaphan-address-use-of-ai-pause-and-think-before-trusting-it",
    "source": "Mashable"
  },
  {
    "id": 14,
    "text": "iPhone Fold design could be similar to Pixel 10 Pro Fold; YouTube video reveals. iPhone Fold design could be similar to Pixel 10 Pro Fold; YouTube video revealsmashable.com",
    "category": "entertainment",
    "url": "https://me.mashable.com/tech/65199/iphone-fold-design-could-be-similar-to-pixel-10-pro-fold-youtube-video-reveals",
    "source": "Mashable"
  },
  {
    "id": 15,
    "text": "Happy New Year 2026 greetings: Best AI prompts to personalise your NY wishes & thoughtful messages. Happy New Year 2026 greetings: Best AI prompts to personalise your NY wishes & thoughtful messagesmashable.com",
    "category": "entertainment",
    "url": "https://me.mashable.com/tech/65181/happy-new-year-2026-greetings-best-ai-prompts-to-personalise-your-ny-wishes-thoughtful-messages",
    "source": "Mashable"
  },
  {
    "id": 16,
    "text": "Apple Teases Major Fitness+ Update in 2026: What’s Coming. Apple Teases Major Fitness+ Update in 2026: What’s Comingmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104116/apple-teases-major-fitness-update-in-2026-whats-coming",
    "source": "Mashable"
  },
  {
    "id": 17,
    "text": "AI Prompts to Create Personalised New Year Wishes That Actually Feel Thoughtful. AI Prompts to Create Personalised New Year Wishes That Actually Feel Thoughtfulmashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104114/ai-prompts-to-create-personalised-new-year-wishes-that-actually-feel-thoughtful",
    "source": "Mashable"
  },
  {
    "id": 18,
    "text": "How to Personalise New Year 2026 Stickers on WhatsApp: A Step-by-Step Guide. How to Personalise New Year 2026 Stickers on WhatsApp: A Step-by-Step Guidemashable.com",
    "category": "entertainment",
    "url": "https://in.mashable.com/tech/104047/how-to-personalise-new-year-2026-stickers-on-whatsapp-a-step-by-step-guide",
    "source": "Mashable"
  },
  {
    "id": 19,
    "text": "OpenAI looks to hire a new Head of Preparedness to deal with AI's dangers. The move to hire for the role comes after multiple wrongful death lawsuits were filed against the ChatGPT maker.",
    "category": "entertainment",
    "url": "https://me.mashable.com/tech/65063/openai-looks-to-hire-a-new-head-of-preparedness-to-deal-with-ais-dangers",
    "source": "Mashable"
  },
  {
    "id": 0,
    "text": "A Week on From Its Company Reshuffle, Ubisoft Has Announced a Just Dance+ Price Increase. Ubisoft's next change following last week's major company reorganization will be a price increase to its Just Dance+ service.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/a-week-on-from-its-company-reshuffle-ubisoft-has-announced-a-just-dance-price-increase",
    "source": "IGN"
  },
  {
    "id": 1,
    "text": "Yes, Ser Arlan Pennytree's 'Formidable Weapon' in A Knight of the Seven Kingdoms Nude Scene Was a 10\" Prosthetic — Here's How the Sausage Was Made. If you’ve watched the latest episode of Game of Thrones spinoff A Knight of the Seven Kingdoms, you might have been left wondering, was that really Ser Arlan Pennytree actor Danny Webb in all his glory? It’s a question that’s been on the internet’s mind ever …",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/yes-ser-arlan-pennytrees-formidable-weapon-in-a-knight-of-the-seven-kingdoms-nude-scene-was-a-10-prosthetic-heres-how-the-sausage-was-made",
    "source": "IGN"
  },
  {
    "id": 2,
    "text": "Marvel's Wonder Man: Series Review (Full Spoilers). Wonder Man is a smaller, low-stakes MCU adventure that thrives on the strength of Yahya Abdul-Mateen II and Ben Kingsley’s performances. Read our full, spoiler-y review of the series.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/marvels-wonder-man-series-review-full-spoilers",
    "source": "IGN"
  },
  {
    "id": 3,
    "text": "The Wrecking Crew Review. Review: The Wrecking Crew could have/should have been more, but the fun chemistry between Jason Momoa and Dave Bautista does the heavy lifting.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/the-wrecking-crew-review-dave-bautista-jason-momoa",
    "source": "IGN"
  },
  {
    "id": 4,
    "text": "The $20 Cordless Electric Air Duster Deal Is No Longer Reserved for Amazon Prime Members. Say goodbye to buying compressed air canisters in bulk.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/cordless-electric-air-duster-holiday-deal-for-january",
    "source": "IGN"
  },
  {
    "id": 5,
    "text": "The Samsung P9 512GB MicroSD Express Card for Nintendo Switch 2 Drops to $79.99. Triples your Switch 2 storage capacity.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/samsung-p9-512gb-microsd-express-nintendo-switch-2-memory-card-deal-january",
    "source": "IGN"
  },
  {
    "id": 6,
    "text": "The $10 Joyroom Apple Watch Charger Has an Internal 2,000mAh Battery for Charging on the Go. It's also a third of the price of the official - but basic - Apple Watch charger.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/joyroom-apple-watch-charger-deal-january-2026",
    "source": "IGN"
  },
  {
    "id": 7,
    "text": "The Powerful 4K-Ready Skytech O11 Vision Radeon 9070 XT Gaming PC Drops to $1,630. The Radeon 9070 XT is comparable to the RTX 5070 Ti.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/skytech-o11-vision-radeon-9070-xt-gaming-pc-deal-at-best-buy",
    "source": "IGN"
  },
  {
    "id": 8,
    "text": "Pokémon TCG: Ascended Heroes - Where to Preorder Before Release Day. Find the best places to buy Pokémon TCG: Ascended Heroes, including ETBs, bundles, tins, and pre-orders before they sell out., Release Dates",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/pokemon-tcg-mega-evolution-ascended-heroes-where-to-buy",
    "source": "IGN"
  },
  {
    "id": 9,
    "text": "Magic: The Gathering Secrets of Strixhaven Is Now Available to Preorder. Secrets of Strixhaven is the next true Magic set",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/magic-the-gathering-secrets-of-strixhaven-tcg-where-to-buy",
    "source": "IGN"
  },
  {
    "id": 10,
    "text": "The Magic: The Gathering Marvel Super Heroes Set Is Up for Preorder. Yet another MTG Universes Beyond set, Marvel Super Heroes, is up for preorder.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/magic-the-gathering-marvel-super-heroes-tcg-where-to-buy",
    "source": "IGN"
  },
  {
    "id": 11,
    "text": "Save $1,600 Off the Lenovo Legion Pro 7 16\" OLED RTX 5090 Gaming Laptop with 64GB of DDR5 RAM. Lenovo's most powerful gaming laptop.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/lenovo-legion-pro-7-16-rtx-5090-gaming-laptop-deal-january-2026",
    "source": "IGN"
  },
  {
    "id": 12,
    "text": "Zootopia 2 Is Now Available to Watch at Home After a Record-Breaking Box Office Run. Zootopia 2 is now available on digital, with a physical release confirmed for March 3.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/zootopia-2-where-to-stream",
    "source": "IGN"
  },
  {
    "id": 13,
    "text": "Amazon Drops AirPods Pro 3 Back to Their Lowest Price Yet. Amazon has dropped the AirPods Pro 3 earbuds back down to $199. This marks a return to their lowest price yet, making for $50 in savings off their usual price of $249.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/airpods-pro-3-all-time-low-amazon-deal-january-2026",
    "source": "IGN"
  },
  {
    "id": 14,
    "text": "The Simpsons' 800th Episode Will Star Noah Wyle, Boyz II Men and Kevin Bacon. The Simpsons has announced a star-studded cast for its landmark 800th episode, which is set to include Kevin Bacon, Noah Wyle, Questlove and Boyz II Men.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/the-simpsons-800th-episode-will-star-noah-wyle-boyz-ii-men-and-kevin-bacon",
    "source": "IGN"
  },
  {
    "id": 15,
    "text": "Daredevil: Born Again Season 2 Trailer Shows Jessica Jones in Action, and Matthew Lillard's Mysterious Character. Marvel has provided our best look yet at Daredevil: Born Again Season 2, showing the return of Krysten Ritter's Jessica Jones and the reveal of Matthew Lillard's mysterious Mr. Charles.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/daredevil-born-again-season-2-trailer-shows-jessica-jones-in-action-and-matthew-lillards-mysterious-character",
    "source": "IGN"
  },
  {
    "id": 16,
    "text": "Emberville Announced for PC; Aims to Be Like Diablo Lite Meets Stardew Valley. Think \"Diablo Lite meets Stardew Valley\" and you've got a good starting point in mind for Emberville, the just-announced pixel-art action-adventure-RPG from developer Cygnus Cross. It features Doug Cockle (The Witcher series) and Alex Jordan (Cyberpunk 2077) …",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/emberville-announced-for-pc-aims-to-be-like-diablo-lite-meets-stardew-valley",
    "source": "IGN"
  },
  {
    "id": 17,
    "text": "Hasbro Reveals New Optimus Prime and Megatron Figures Inspired by Transformers: The Movie. Your Transformers collection will have The Touch when you add these awesome new Optimus Prime and Megatron figures inspired by 1986's Transformers: The Movie.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/hasbro-reveals-new-optimus-prime-and-megatron-figures-inspired-by-transformers-the-movie",
    "source": "IGN"
  },
  {
    "id": 18,
    "text": "LEGO Just Announced 5 More Star Wars Sets With Smart Bricks, Including a New Millennium Falcon, Mos Eisley Cantina and More. LEGO has announced another five Star Wars sets infused with its Smart Brick, doubling down on its freshly-announced interactive technology.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/lego-just-announced-5-more-star-wars-sets-with-smart-bricks-including-a-new-millennium-falcon-mos-eisley-cantina-and-more",
    "source": "IGN"
  },
  {
    "id": 19,
    "text": "Amazon's Sophie Turner Tomb Raider Series Secretly Stars a Previous Lara Croft. A former Lara Croft actress has been spotted filming for Amazon Prime's new Tomb Raider series starring Sophie Turner.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/amazons-sophie-turner-tomb-raider-series-secretly-stars-a-previous-lara-croft",
    "source": "IGN"
  },
  {
    "id": 20,
    "text": "Ubisoft Developer Hits Back at 'Online Conspiracy Theories' Suggesting DEI to Blame For Company Issues, Suggests Creativity Instead Suffering from 'Big Business Syndrome'. A former Ubisoft Osaka staff member has spoken out against persistent \"online conspiracy theories\" that the publisher's performance is being impacted by a focus on DEI (Diversity, Equity and Inclusion) initiatives, rather than the company instead suffering fr…",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/ubisoft-developer-hits-back-at-online-conspiracy-theories-suggesting-dei-to-blame-for-company-issues-suggests-creativity-instead-suffering-from-big-business-syndrome",
    "source": "IGN"
  },
  {
    "id": 21,
    "text": "We Visited PokéPark KANTO, the First Permanent Outdoor Pokémon Attraction. The Pokemon PokePark is already shaping up to be a must-visit for Pokemon superfans.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/we-visited-pokepark-kanto-japans-real-life-pokemon-park",
    "source": "IGN"
  },
  {
    "id": 22,
    "text": "ReBlade: The Death Spiral, a New Cyberpunk Action Roguelike, Announced for PC. Developer ChillyRoom and publisher Spiral Up Games have announced ReBlade: The Death Spiral, a new cyberpunk action roguelike. You'll run through its dystopian city as many times as it takes as a condemned Synthetic fighting your way through to get at the tru…",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/reblade-a-new-cyberpunk-action-roguelike-announced-for-pc",
    "source": "IGN"
  },
  {
    "id": 23,
    "text": "The Bose QuietComfort Wireless Noise Canceling Headphones Drops to Just $129.99. Professionally refurbished by Bose and includes a 1 year manufacturer's warranty.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/bose-quietcomfort-wireless-noise-canceling-headphone-deal-woot",
    "source": "IGN"
  },
  {
    "id": 24,
    "text": "The First Harry Potter Illustrated Edition in Four Years Is Now Up for Preorder. ",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/harry-potter-and-the-half-blood-prince-illustrated-edition-where-to-buy",
    "source": "IGN"
  },
  {
    "id": 25,
    "text": "The 65\" Samsung 4K OLED Smart TV Drops to $899.99 at Best Buy. Matches Best Buy's best Black Friday deal.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/samsung-s84f-4k-oled-smart-tv-deal-at-best-buy",
    "source": "IGN"
  },
  {
    "id": 26,
    "text": "Fallout Season 2's Final Two Episodes Will Now Premiere a Day Earlier. Prime Video announced Monday that they’re moving up the release dates for the final two episodes of Fallout: Season 2. Episode 7 will now launch Tuesday, January 27th at 6pm PT and the season finale, Episode 8, will now begin streaming on Tuesday, Feb. 3rd at…",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/fallout-season-2s-final-two-episodes-will-now-premiere-a-day-earlier",
    "source": "IGN"
  },
  {
    "id": 27,
    "text": "Today’s Best Deals: The Legend of Zelda Complete Box Set, MTG Lorywn Eclipsed TCG, and More. Plus, save on DRAGON BALL: Sparking! ZERO, rechargeable hand warmers, a compact gaming keyboard, and more.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/best-deals-for-january-26-2026",
    "source": "IGN"
  },
  {
    "id": 28,
    "text": "Top 10 Riftbound Origins Cards to Pick Up Before Spiritforged Comes Out. Here's 10 Riftbound Origins cards to check out before Spiritforged lands on February 13.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/top-10-riftbound-origins-cards-to-pick-up-before-spiritforged-comes-out",
    "source": "IGN"
  },
  {
    "id": 29,
    "text": "Resident Evil Requiem Director Gives Definitive Response to Open World 'Speculation'. Capcom has responded to ongoing fan speculation about Resident Evil Requiem being an open world game with a definitive-sounding response.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/resident-evil-requiem-director-gives-definitive-response-to-open-world-speculation",
    "source": "IGN"
  },
  {
    "id": 30,
    "text": "Razer Raiju V3 Pro Review: A Top-End PS5 and PC Controller Only Limited by Sony Restrictions. The Razer Raiju V3 Pro is a powerful PS5 and PC controller with the latest tech, so what stops it from being a perfect IGN 10? Here's our full review.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/razer-raiju-v3-pro-controller-review",
    "source": "IGN"
  },
  {
    "id": 31,
    "text": "Iconic Horror Villains Get a Fresh Look in Funko x WBD Mystery Pops! Series. Funko has revealed a new line of blind box Mystery Pop! figures, with the first series focusing on iconic horror villains like Annabelle and Pennywise.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/iconic-horror-villains-get-a-fresh-look-in-funko-x-wbd-mystery-pops-series",
    "source": "IGN"
  },
  {
    "id": 32,
    "text": "The First Big Arc Raiders Update of 2026 Adds Solo vs. Squads Matchmaking, 'Bird City,' and More Tomorrow. Embark Studios is launching into new Arc Raiders content when the Headwinds update brings a solo vs. squads matchmaking option, a Bird City map condition, and more to the experience tomorrow.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/the-first-big-arc-raiders-update-of-2026-adds-solo-vs-squads-matchmaking-bird-city-and-more-tomorrow",
    "source": "IGN"
  },
  {
    "id": 33,
    "text": "Nintendo anuncia Direct exclusivo para Tomodachi Life: Living The Dream para esta quinta-feira (29). Animal Crossing com Miis!",
    "category": "entertainment",
    "url": "https://br.ign.com/tomodachi-life/150351/news/nintendo-anuncia-direct-exclusivo-para-tomodachi-life-living-the-dream-para-esta-quinta-feira-29",
    "source": "IGN"
  },
  {
    "id": 34,
    "text": "Pokémon TCG: Scarlet & Violet – Destined Rivals Booster Bundles Are Back In Stock and at Market Price on Amazon. Amazon has restocked Pokémon TCG Destined Rivals booster bundles at market price, matching TCGplayer and offering fast, reliable shipping.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/pokemon-tcg-scarlet-violet-destined-rivals-booster-bundles-market-price-amazon",
    "source": "IGN"
  },
  {
    "id": 35,
    "text": "Nintendo Direct Announced For This Week, Focused on Tomodachi Life: Living The Dream. Another Nintendo Direct is coming this Thursday, January 29, dedicated to the company's upcoming social sim game Tomodachi Life: Living the Dream.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/nintendo-direct-announced-for-this-week-focused-on-tomodachi-life-living-the-dream",
    "source": "IGN"
  },
  {
    "id": 36,
    "text": "Intel Could Take The Handheld Crown From AMD With Panther Lake. ",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/intel-could-take-the-handheld-crown-from-amd-with-panther-lake",
    "source": "IGN"
  },
  {
    "id": 37,
    "text": "Sam Raimi Says There's No Chance of a Spider-Man 4 Starring Tobey Maguire Happening, and His Versions of Peter Parker and Mary Jane 'Have Gone Elsewhere'. Director Sam Raimi has ruled out making a belated fourth film for Tobey Maguire's Spider-Man despite once having plans to do so, as his versions of Peter Parker and Mary Jane Watson \"have gone elsewhere.\"",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/sam-raimi-says-theres-no-chance-of-a-spider-man-4-starring-tobey-maguire-happening-and-his-versions-of-peter-parker-and-mary-jane-have-gone-elsewhere",
    "source": "IGN"
  },
  {
    "id": 38,
    "text": "Kingsman265 Drama Explained: Here's Why Everyone Can't Stop Talking About a $40,000 Marvel Rivals Tournament. The “Kingsman265 drama” began just earlier this month and is evolving every day, so we did our best to explain the story so far for those who need to know what’s got the internet so worked up.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/kingsman265-drama-explained-heres-why-everyone-cant-stop-talking-about-a-40000-marvel-rivals-tournament",
    "source": "IGN"
  },
  {
    "id": 39,
    "text": "Highguard Global Release Times Confirmed Ahead of Launch Showcase. Debuting at The Game Awards 2025 with an end-of-show reveal trailer, Highguard is a new free-to-play PvP raid shooter hailing from some of the creators of Respawn's Apex Legends and Titanfall. Check out the global release time to find out when you'll be able …",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/highguard-global-release-times-confirmed-ahead-of-launch-showcase",
    "source": "IGN"
  },
  {
    "id": 40,
    "text": "Star Wars: Starfighter Writer Rules Out Any Secret Cameos, Insists it Really is Standalone With 'No Legacy Characters'. The writer behind upcoming movie Star Wars: Starfighter has ruled out the chance of any familiar face from the franchise's past making a secret cameo, after a recent report confirmed the film would feature a lightsaber duel.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/star-wars-starfighter-writer-rules-out-any-secret-cameos-insists-it-really-is-standalone-with-no-legacy-characters",
    "source": "IGN"
  },
  {
    "id": 41,
    "text": "Pokémon TCG: Perfect Order Preorders Are Up at TCGplayer, Revealing the Latest Market Price Data for Sealed Products. Just as it did with Ascended Heroes, TCGplayer has recently launched its selection of presale listings for Perfect Order, giving plenty of fans an alternative to secure the upcoming set, and revealing the latest market price data for the upcoming Mega Evoluti…",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/pokemon-tcg-mega-evolution-perfect-order-sealed-products-are-up-for-preorder-at-tcgplayer",
    "source": "IGN"
  },
  {
    "id": 42,
    "text": "'This Is Embarrassing and Leads to Nothing' — DC Fans Hit Out at Social Media User After James Gunn Responds to Sam Raimi Batman Spammer. DC fans have criticized a social media user for spamming James Gunn about Spider-Man director Sam Raimi wanting to make a Batman movie after the DC Universe boss responded to the deluge on Instagram.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/this-is-embarrassing-and-leads-to-nothing-dc-fans-hit-out-at-social-media-user-after-james-gunn-responds-to-sam-raimi-batman-spammer",
    "source": "IGN"
  },
  {
    "id": 43,
    "text": "One of Sony's PlayStation Plus Monthly Games for February Has Leaked. A reliable leaker has revealed Sony's main PlayStation Plus Monthly offering for February, more than a week before it becomes available.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/one-of-sonys-playstation-plus-monthly-games-for-february-has-leaked",
    "source": "IGN"
  },
  {
    "id": 44,
    "text": "The Weirdest Things That Happened in the Original Final Fantasy 7. ",
    "category": "entertainment",
    "url": "https://es.ign.com/gallery/182607/the-weirdest-things-that-happened-in-the-original-final-fantasy-7?p=1",
    "source": "IGN"
  },
  {
    "id": 45,
    "text": "Primal Season 3, Episode 3 Review. Review: “Feast of Flesh,” Episode 3 of Season 3, is a standout, featuring all of the emotion and beauty of Genndy Tartakovsky’s strange world.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/primal-season-3-episode-3-review-recap-feast-of-flesh",
    "source": "IGN"
  },
  {
    "id": 46,
    "text": "A Knight of the Seven Kingdoms: Season 1, Episode 2 Review. “Hard Salt Beef” plants the seeds of doubt in Dunk’s dream to be A Knight of the Seven Kingdoms in this sturdy follow-up to the series premiere.",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/a-knight-of-the-seven-kingdoms-season-1-episode-2-review",
    "source": "IGN"
  },
  {
    "id": 47,
    "text": "De Pokémon a RPG pós-apocalíptico: novo jogo da Game Freak é radicalmente diferente de todos os seus títulos anteriores. Preparem-se para Beast of Reincarnation",
    "category": "entertainment",
    "url": "https://br.ign.com/pokemon/150317/news/de-pokemon-a-rpg-pos-apocaliptico-novo-jogo-da-game-freak-e-radicalmente-diferente-de-todos-os-seus",
    "source": "IGN"
  },
  {
    "id": 48,
    "text": "The Best Deals Today: Towa and the Guardians of the Sacred Tree, Tekken 8, Octopath Traveler 0, and More. ",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/best-deals-for-january-25-2026",
    "source": "IGN"
  },
  {
    "id": 49,
    "text": "The Best Deals Today: Octopath Traveler 0, Yakuza Kiwami 1+2, and More. ",
    "category": "entertainment",
    "url": "https://www.ign.com/articles/best-deals-for-january-24-2026",
    "source": "IGN"
  },
  {
    "id": 0,
    "text": "Alzheimer's: Blood sugar spikes may be a sign of heightened risk. People who have a predisposition to blood sugar spikes after a meal may also have a heightened risk of Alzheimer's disease, a recent study suggests.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/predisposition-to-blood-sugar-spikes-linked-to-69-higher-alzheimers-risk",
    "source": "Medical News Today"
  },
  {
    "id": 1,
    "text": "Measles: UK, other European countries lose measles elimination status. The WHO has announced that the U.K. and five other European countries have lost their measles elimination status. Find out what this means.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/uk-european-nations-lose-measles-elimination-status",
    "source": "Medical News Today"
  },
  {
    "id": 2,
    "text": "Breast cancer: Blood test may predict which treatment will work best. A new liquid biopsy that detects tiny amounts of cancer DNA in the blood may help monitor treatment and predict how well it is working.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/liquid-biopsy-test-may-offer-faster-feedback-on-breast-cancer-therapy",
    "source": "Medical News Today"
  },
  {
    "id": 3,
    "text": "Plant-forward diet, less sugar may help prevent kidney disease. A plant-forward EAT-Lancet diet with less meat and less sugar may help prevent and reduce the risk of chronci kidney disease, according to a study published in the Canadian Medical Association Journal.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/more-plants-less-meat-could-reduce-risk-kidney-disease-study",
    "source": "Medical News Today"
  },
  {
    "id": 4,
    "text": "Mental health: Increased AI use may relate to depression, anxiety. Personal usage of generative AI may increase the risk of depression, anxiety, and irritability, a new study finds.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/frequent-ai-use-linked-to-higher-depression-rates-study-warns",
    "source": "Medical News Today"
  },
  {
    "id": 5,
    "text": "Diabetes: AI model and blood test may identify risk sooner. Recent advances in diabetes detection may help to identify risk earlier. In this article, MNT discusses recent studies that suggest both an AI test and a blood test could help to highlight diabetes risk sooner than current methods.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/ai-platform-and-blood-test-may-better-predict-diabetes-risk",
    "source": "Medical News Today"
  },
  {
    "id": 6,
    "text": "Longevity: Can the shingles vaccine help slow down aging?. Older adults vaccinated against shingles appear to experience slower biological aging, according to a new study.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/shingles-vaccine-may-help-slow-biological-aging",
    "source": "Medical News Today"
  },
  {
    "id": 7,
    "text": "Heart failure: Medication text reminders improve treatment adherence. A new study suggests that receiving text-based 'nudges' could help remind patients to refill their prescriptions, which may also help to reduce readmission rates.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/text-reminders-may-help-heart-failure-patients-avoid-readmission",
    "source": "Medical News Today"
  },
  {
    "id": 8,
    "text": "Vascular dementia: Keeping weight in check may aid prevention. Obesity may increase a person's risk of vascular dementia by influencing factors such as blood pressure, a news study suggests.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/obesity-risk-factor-vascular-dementia",
    "source": "Medical News Today"
  },
  {
    "id": 9,
    "text": "Longevity: Mixing different physical activities may prolong life span. Regularly engaging in a variety of physical activities such as walking, cycling, and swimming, may be the best way to prolong life span, according to a study published in BMJ Medicine.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/types-physical-activity-help-prolong-life-span-longevity-exercise",
    "source": "Medical News Today"
  },
  {
    "id": 10,
    "text": "AI-ready database offers collaborative approach to cancer research. The Cancer Research Institute launches a first-of-its-kind open-access database to help scientists better understand how the immune system responds to cancer treatments over time. The collaborative approach aims to overcome a longstanding challenge in immunot…",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/ai-ready-open-database-aims-to-accelerate-cancer-immunotherapy-research",
    "source": "Medical News Today"
  },
  {
    "id": 11,
    "text": "Tylenol use in pregnancy does not cause autism, ADHD, review finds. There is no link between acetaminophen use in pregnancy and autism or ADHD risk for the offspring, a new gold-standard review of the evidence, conducted by researchers in Europe, concludes.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/gold-standard-review-denies-link-between-tylenol-pregnancy-autism-adhd-risk",
    "source": "Medical News Today"
  },
  {
    "id": 12,
    "text": "US vaccine guidelines: What do the changes mean for clinicians?. Recent changes to the national immunization schedules have raised questions and caused confusion that could complicate care decisions and coverage, but what do these changes mean for clinicians?",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/us-vaccine-changes-challenge-clinical-practice-insurance-coverage",
    "source": "Medical News Today"
  },
  {
    "id": 13,
    "text": "Aging muscles: How does exercise help prevent protein decline?. Scientists have discovered how exercise protects aging muscles by suppressing DEAF1, a molecule they identified as a driver of muscle decline.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/exercise-prevents-muscle-loss-aging-how-protein-biology",
    "source": "Medical News Today"
  },
  {
    "id": 14,
    "text": "To live longer, try cutting sitting time down by 30 minutes. As little as 5 extra minutes of moderate-to-vigorous physical activity each day could help prevent 6% of deaths among those who are the least active, a large new study has found.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/moving-just-5-more-minutes-each-day-could-boost-longevity",
    "source": "Medical News Today"
  },
  {
    "id": 15,
    "text": "New AI platform could help more cancer patients access clinical trials. Researchers at Mount Sinai launch a new AI platform to match more cancer patients with clinical trials, aiming to expand enrolment.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/mount-sinai-ai-tool-aims-to-improve-access-to-cancer-clinical-trials",
    "source": "Medical News Today"
  },
  {
    "id": 16,
    "text": "Type 2 diabetes: Timing or type of menopause does not affect risk. The timing or type of menopause does not impact the risk of developing type 2 diabetes but certain health and lifestyle factors may, a new study finds.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/early-menopause-not-linked-higher-type-2-diabetes-risk",
    "source": "Medical News Today"
  },
  {
    "id": 17,
    "text": "Dementia: HRT for menopause does not increase risk. Hormone replacement therapy (HRT) to treat menopause symptoms does not increase dementia risk, according to a new study.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/hrt-does-not-increase-dementia-risk-in-women",
    "source": "Medical News Today"
  },
  {
    "id": 18,
    "text": "Chat GPT Health: Expert take on AI’s role in modern medicine. Following the release of ChatGPT Health, due to an increased interest in AI-driven medical guidance, MNT discusses the role of AI health advice with AI-in-clinical-medicine expert David Liebovitz.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/is-chatgpt-health-the-future-of-ai-medical-advice",
    "source": "Medical News Today"
  },
  {
    "id": 19,
    "text": "Prostate cancer: Simple tool may help to spot metastatic cancer sooner. University Hospitals Seidman Cancer Center researchers have developed a tool that could identify metastatic prostate cancer earlier. This tool may help guide treatment, such as signalling when to intervene, intensify treatment, or enrol in trials.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/new-tool-can-help-identify-metastatic-prostate-cancer-risk-earlier",
    "source": "Medical News Today"
  },
  {
    "id": 20,
    "text": "Hypertension: More beige fat linked to better blood pressure control. Scientists have found that beige fat, unlike white fat, may actually help control blood pressure, via a study in mice, which could lead to new treatments for hypertension.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/beige-fat-may-help-regulate-blood-pressure-mice-study",
    "source": "Medical News Today"
  },
  {
    "id": 21,
    "text": "Crohn's disease: Low-calorie, plant-based diet may help. A form of very low-calorie fasting-mimicking diet may help alleviate symptoms of mild-to-moderate Crohn's disease.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/fasting-mimicking-diet-may-help-with-crohns-disease",
    "source": "Medical News Today"
  },
  {
    "id": 22,
    "text": "Type 2 diabetes, cancer: Common food preservatives may heighten risk. A number of commonly used food preservatives were linked to a higher risk of type 2 diabetes and many forms of cancer in two new studies from the same team.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/food-preservatives-linked-to-type-2-diabetes-and-cancer-studies-warn",
    "source": "Medical News Today"
  },
  {
    "id": 23,
    "text": "Food pyramid gets review with new US 2026 dietary guidelines. The new U.S. dietary guidelines call for prioritizing high-quality protein, healthy fats, and avoiding sugars and processed foods. Here's what experts think of these changes.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/4-key-changes-us-dietary-guidelines-prioritize-protein-full-fat-dairy",
    "source": "Medical News Today"
  },
  {
    "id": 24,
    "text": "Diabetes, kidney disease: Light exercise may help lower death risk. Light physical activity may help lower death risk in cardiovascular-kidney-metabolic syndrome, a condition that includes heart disease, kidney disease, obesity, and type 2 diabetes.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/walking-house-chores-may-help-lower-diabetes-heart-disease-death-risk",
    "source": "Medical News Today"
  },
  {
    "id": 25,
    "text": "Heart disease: High cholesterol linked to increased 30-year risk. A new study found that having higher lipoprotein(a) levels was linked to an increased 30-year risk for cardiovascular disease, even in healthy women.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/high-cholesterol-predict-future-heart-disease-risk-lipoprotein-healthy-women",
    "source": "Medical News Today"
  },
  {
    "id": 26,
    "text": "Supercentenarians: How can you live past 110?. Brazil holds a record number of supercentenarians, people who live healthy lives past 110. What is the secret to their longevity",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/many-brazilians-live-past-110-what-are-their-secrets",
    "source": "Medical News Today"
  },
  {
    "id": 27,
    "text": "Can exercise treat depression just as well as therapy?. Getting enough exercise, especially light to moderate intensity, may help reduce depression symptoms as effectively as psychological therapy, a new study suggests.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/exercise-may-reduce-depression-symptoms-as-effectively-as-therapy",
    "source": "Medical News Today"
  },
  {
    "id": 28,
    "text": "Blue Monday: Let us lay this mental health myth to rest. Blue Monday, the most depressing day of the year: Is there any science behind it, or is it just a myth that has gained too much momentum over time?",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/mental-health-myth-blue-monday-depression-sad-january",
    "source": "Medical News Today"
  },
  {
    "id": 29,
    "text": "Vascular dementia: Scientists find way to restore brain blood flow. Scientists have found that adding a missing phospholipid back into the bloodstream might help improve blood flow and reduce the symptoms of dementia, which could lead to a new treatment.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/restoring-missing-lipid-ease-vascular-dementia-damage-brain-study",
    "source": "Medical News Today"
  },
  {
    "id": 30,
    "text": "Alzheimer's: Experimental treatment restores memory in mice. A new drug candidate shows promise by reversing cognitive decline in advanced Alzheimer's disease by restoring brain balance in an animal study.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/experimental-drug-reverses-alzheimers-in-mice",
    "source": "Medical News Today"
  },
  {
    "id": 31,
    "text": "ADHD: Common Medications May Work Differently Than Previously Believed. A new study suggests that common medications prescribed to help manage ADHD, such as Adderall and Ritalin, may work differently than believed.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/adhd-stimulants-dont-work-the-way-we-thought-they-did",
    "source": "Medical News Today"
  },
  {
    "id": 32,
    "text": "Dementia: Disturbances to circadian rhythm may increase risk. The results of a recent study suggest that people with a weaker or more irregular body clock, also known as circadian rhythm, may have a higher risk of developing dementia.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/body-clock-disturbances-may-contribute-to-dementia-risk-evidence-suggests",
    "source": "Medical News Today"
  },
  {
    "id": 33,
    "text": "Colorectal cancer: 10-12 minute bursts of exercise may halt growth. A short burst of intense exercise — as little as 10 to 12 minutes — may be able to provide benefits such as slowing the growth of colorectal cancer cells, a new study has found.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/10-minutes-intense-exercise-may-treat-prevent-colorectal-cancer",
    "source": "Medical News Today"
  },
  {
    "id": 34,
    "text": "Breast cancer: Hot flash drug slows tumor growth even at low doses. Megestrol, which helps treat hot flashes associated with menopause, may have the added benefit of slowing the growth of ER-positive breast tumors, a new trial has found.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/hot-flash-treatment-menopause-slow-breast-cancer-growth-trial-megestrol-letrozole",
    "source": "Medical News Today"
  },
  {
    "id": 35,
    "text": "FDA approves first pill for weight loss: 5 things to know. MNT speaks with three obesity medicine experts to find out more about the FDA-aproved Wegovy pill and how it's different from the Wegovy injection.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/wegovy-weight-loss-pill-comparison-injections-side-effects-contraindications",
    "source": "Medical News Today"
  },
  {
    "id": 36,
    "text": "Dementia: 3 reasons poor sleep may increase risk. Medical News Today looks at three key studies and their key findings that highlight and further confirm the connection between how poor sleep increases dementia risk.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/sleep-quality-insomnia-sleep-apnea-increase-dementia-risk-latest-evidence",
    "source": "Medical News Today"
  },
  {
    "id": 37,
    "text": "Heart health: Should you get your B12 from diet or supplements?. Vitamin B12 is a vital nutrient that plays numerous key roles in maintaining health. It is available in different forms and can be found in both food and supplements. A recent review suggests that the natural version could be more beneficial.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/diet-vs-supplements-which-b12-form-is-better-for-health",
    "source": "Medical News Today"
  },
  {
    "id": 38,
    "text": "'Dry January': Can 1 month of no alcohol have a real effect on health?. Abstaining from alcohol for just one month as part of 'Dry January' can offer meaningful physical and psychological improvements, including better sleep, and weight loss, a new study confirms.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/dry-january-1-month-no-alcohol-difference-health-study",
    "source": "Medical News Today"
  },
  {
    "id": 39,
    "text": "Could these 7 behaviors help extend lifespan after a cancer diagnosis?. A study has found that people exercise regularly, quit smoking, and practice five other health strategies can improve their chances of living longer after cancer.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/7-heart-healthy-behaviors-help-increase-longevity-after-cancer",
    "source": "Medical News Today"
  },
  {
    "id": 40,
    "text": "Brain aging: Creative pursuits may help support brain health. Research suggests that individuals who partake in creative activities, such as arts and crafts, musical instruments, and gardening, typically have a more youthful brain on average.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/dancing-reading-and-video-games-could-help-delay-brain-aging",
    "source": "Medical News Today"
  },
  {
    "id": 41,
    "text": "Could probiotics help manage and prevent eczema and acne?. A review indicates that probiotic, prebiotic, and synbiotic supplements could be beneficial for skin health, especially for managing conditions such as eczema.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/supplements-that-support-gut-health-may-also-benefit-skin-health",
    "source": "Medical News Today"
  },
  {
    "id": 42,
    "text": "How much coffee should you drink for a long, healthy life?. Coffee may boost longevity and lower diabetes risk according to the latest research. Here is what the evidence tells us.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/roundup-coffee-and-longevity-3-studies-explore-how-coffee-may-benefit-healthy-aging",
    "source": "Medical News Today"
  },
  {
    "id": 43,
    "text": "Chronic pain: 5 healthy habits linked to 8 years younger brain. A few simple, healthy habits have been linked to 8 years younger brain, even in people with chronic pain.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/5-healthy-habits-may-help-keep-the-brain-younger-even-with-chronic-pain",
    "source": "Medical News Today"
  },
  {
    "id": 44,
    "text": "Anxiety, depression: Less social media use can improve symptoms. Recent research shows that reducing social media use for at least one week can lower rates of anxiety, depression, and insomnia in young adults.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/1-week-social-media-break-could-boost-mental-health",
    "source": "Medical News Today"
  },
  {
    "id": 45,
    "text": "Dementia: Driving habits could be a marker of brain health. Can driving patterns help predict cognitive decline later in life? A new study finds that certain changes in driving habits may point to mild cognitive impairment.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/changes-driving-patterns-predict-cognitive-decline-dementia",
    "source": "Medical News Today"
  },
  {
    "id": 0,
    "text": "Listen: Transfers and Trusty - the SPFL window update. We discuss the Auston Trusty red card and look at the SPFL clubs in the transfer window.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mxkhj3",
    "source": "BBC News"
  },
  {
    "id": 1,
    "text": "NI education: Teacher uses conscience clause to withdraw from RE teaching. Javed Love is understood to be the first teacher in Northern Ireland in at least a decade to take the action.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c93vx98z5dno",
    "source": "BBC News"
  },
  {
    "id": 2,
    "text": "BBC Women's Football Weekly. England defender Jess Carter opens up about receiving online racial abuse",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mx9fmq",
    "source": "BBC News"
  },
  {
    "id": 3,
    "text": "'I don't let bullies win,' says US congresswoman Omar after substance thrown at her. The Minnesota Democrat was uninjured and continued to speak at her event, after being sprayed with an unidentified liquid.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cn9zpee3llxo",
    "source": "BBC News"
  },
  {
    "id": 4,
    "text": "Amazon confirms 16,000 job cuts after accidental email. The technology giant confirmed the redundancies hours after it told staff in an email sent in error.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cx2ywzxlxnlo",
    "source": "BBC News"
  },
  {
    "id": 5,
    "text": "Intrusive thoughts: 'What if I just started shouting right now?'. Most of us will have intrusive thoughts at some point. Dr Nina Higson-Sweeney explains when you should seek help.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/czejjr7wz6ko",
    "source": "BBC News"
  },
  {
    "id": 6,
    "text": "Shepherd's Eye In The Sky. Africa's 250 million nomadic herders, or pastoralists, are the invisible keystone of the continent's food system. They provide 50% of Africa's meat and 75% of its milk, moving livestock across vast rangelands in response to seasons, weather and grazing patter…",
    "category": "health",
    "url": "https://www.bbc.co.uk/programmes/p0mx9dxv",
    "source": "BBC News"
  },
  {
    "id": 7,
    "text": "EasyJet ad banned for claiming bags available for £5.99. The airline said the fact there were no bags available for less than £5.99 meant the claim was not misleading.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cddgp9jgjz1o",
    "source": "BBC News"
  },
  {
    "id": 8,
    "text": "Episode 4: Flying High. Kimi Antonelli and Ollie Bearman hit career F1 highs. Cadillac stage a race simulation.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mwsqyr",
    "source": "BBC News"
  },
  {
    "id": 9,
    "text": "Vets may have to publish prices of common treatments in government plans. The government sets out proposals as data finds vet prices rose at nearly twice the inflation rate.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cd7zpgn5n47o",
    "source": "BBC News"
  },
  {
    "id": 10,
    "text": "Trump border czar arrives in Minnesota. The new head of the immigration enforcement operation in Minnesota, Tom Homan, has met the state governor as the White House attempts to address the criticism following the fatal shootings of Alex Pretti and Renée Good by ICE agents in Minneapolis.\n\nAlso in t…",
    "category": "health",
    "url": "https://www.bbc.co.uk/programmes/w172zssk89gndbd",
    "source": "BBC News"
  },
  {
    "id": 11,
    "text": "Ex-Nigeria oil minister Diezani Alison-Madueke stands trial in UK on bribery charges. Diezani Alison-Madueke is accused of accepting bribes from industry figures interested in Nigerian government contracts, a court in London has heard.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/ckglpd167n9o",
    "source": "BBC News"
  },
  {
    "id": 12,
    "text": "Growing number of adults avoid booze, NHS survey suggests. Almost a quarter of adults in England do not drink alcohol, according to new figures from a health survey.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c1dk2xp137zo",
    "source": "BBC News"
  },
  {
    "id": 13,
    "text": "British Army officer dies after incident during live fire training. The 25-year-old died on Sunday after the incident at an army training site in Northumberland.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cly9p153kv9o",
    "source": "BBC News"
  },
  {
    "id": 14,
    "text": "Bola Tinubu: Nigeria president 'in great shape' after falling over at Turkey reception. On a visit to Ankara, Bola Tinubu was filmed stumbling and falling after walking past soldiers and dignitaries.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cvgpz16q2xdo",
    "source": "BBC News"
  },
  {
    "id": 15,
    "text": "Scotcast: Could Gordon McQueen's death change football?. An ex-pro on whether the game can protect players from brain injury.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/m002qgtg",
    "source": "BBC News"
  },
  {
    "id": 16,
    "text": "India and EU announce the 'mother of all trade deals'. The European Commission president Ursula Von Der Leyen has celebrated the signing of a trade agreement with India, saying it sent a message that international cooperation could still work. The remarks have been taken as a dig at President Trump - with the agr…",
    "category": "health",
    "url": "https://www.bbc.co.uk/programmes/w172zssk89gmk3h",
    "source": "BBC News"
  },
  {
    "id": 17,
    "text": "Rwanda seeks £100m from UK over axed asylum deal. The African nation argues it is owed payments but the Home Office says it will fight the case.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/czx32yxnvzro",
    "source": "BBC News"
  },
  {
    "id": 18,
    "text": "Aptamil infant formula batch recalled in UK over toxin discovery. Parents are warned to return any of the specific product affected because it is not safe for babies to consume.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c1lz2m02rzzo",
    "source": "BBC News"
  },
  {
    "id": 19,
    "text": "The English We Speak: Shoot off. This expression means leave quickly because you're in a hurry or there's somewhere you need to be. Learn how to use it here.FIND A TRANSCRIPT:\n✔️ https://www.bbc.co.uk/learningenglish/english/features/the-english-we-speak_2026/ep-260126BEATING SPEAKING ANXIET…",
    "category": "health",
    "url": "https://www.bbc.co.uk/programmes/p0mxfwd7",
    "source": "BBC News"
  },
  {
    "id": 20,
    "text": "Pubs to get £80m support package after business rates backlash. Treasury Minister Dan Tomlinson says the three-year aid was worth £1,650 for the average pub.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c78vqj99168o",
    "source": "BBC News"
  },
  {
    "id": 21,
    "text": "US to send ICE agents to Winter Olympics, prompting Italian anger. The US federal agency says it will not play an immigration role at February's event in Milan-Cortina.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c5y29xzjdzvo",
    "source": "BBC News"
  },
  {
    "id": 22,
    "text": "Australian Open Daily: Gauff out as Alcaraz reaches semis. Carlos Alcaraz reaches his first Australian Open semi-final, Coco Gauff is knocked out and Aryna Sabalenka's campaign rolls on.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mxf5gy",
    "source": "BBC News"
  },
  {
    "id": 23,
    "text": "What is 'polygamous working?' Why are some Londoners doing it?. Low pay and boredom are causing some to seek two full time jobs at once.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mxdr4j",
    "source": "BBC News"
  },
  {
    "id": 24,
    "text": "What's Up Docs? - How can we sustain a healthy diet? - BBC Sounds. What's Up Docs? - How can we sustain a healthy diet? - BBC Soundsbbc.co.uk",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/m002qjc0",
    "source": "BBC News"
  },
  {
    "id": 25,
    "text": "Traitors winner Rachel Duffy 'heartbroken' following mum's death. Writing on Instagram, Rachel Duffy said she was \"heartbroken\" at the death of her \"beautiful wee mummy\".",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/czdq2nlgz6jo",
    "source": "BBC News"
  },
  {
    "id": 26,
    "text": "Carol Kirkwood: BBC Breakfast weather presenter to leave after 25 years. The 63-year-old said it had been an \"absolute privilege\" to bring viewers the weather every day.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cedwp8w1j24o",
    "source": "BBC News"
  },
  {
    "id": 27,
    "text": "Actor Idris Elba: ‘I want to do a musical!’. The Luther and Hijack star revealed his secret ambition to Robert Elms in 2014.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mx8fdj",
    "source": "BBC News"
  },
  {
    "id": 28,
    "text": "Podcast: Championship title race tightens & League 1 on knife-edge. Could we see a new leader in the Championship? Plus an incredible League One title race.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mxct96",
    "source": "BBC News"
  },
  {
    "id": 29,
    "text": "Meta to trial premium subscriptions for Instagram, Facebook and WhatsApp. Meta to trial premium subscriptions for Instagram, Facebook and WhatsAppbbc.co.uk",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/ce8rpdmm284o",
    "source": "BBC News"
  },
  {
    "id": 30,
    "text": "BBC Women's Football Weekly. Is the title race over?",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mx97vk",
    "source": "BBC News"
  },
  {
    "id": 31,
    "text": "Nigeria: Killings, land and cattle. On Christmas Day 2025, the US carried out missile strikes on suspected Islamist militants in Nigeria. They came after President Trump said he would intervene to protect Christians amid controversial claims of a “Christian genocide” in the country. The Nigeria…",
    "category": "health",
    "url": "https://www.bbc.co.uk/programmes/p0mx8ffc",
    "source": "BBC News"
  },
  {
    "id": 32,
    "text": "Menopause linked to Alzheimer's-like brain changes. Menopause is linked to a loss of grey matter in regions involved with memory and emotion, study suggests.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/c9qpp1g5ylvo",
    "source": "BBC News"
  },
  {
    "id": 33,
    "text": "Ground rents to be capped at £250 a year for leaseholders. The reforms for England and Wales also include proposals to ban the sale of new leasehold flats.",
    "category": "health",
    "url": "https://www.bbc.co.uk/news/articles/cdjn7jdvn7no",
    "source": "BBC News"
  },
  {
    "id": 34,
    "text": "Israel: remains of final Gaza hostage returned. The Israeli military says it has retrieved the body of the last hostage in Gaza, paving the way for the next phase of US President Donald Trump's peace plan to get under way. Ran Gvili, a policeman, was one of 251 hostages taken in the Hamas-led attack on Isr…",
    "category": "health",
    "url": "https://www.bbc.co.uk/programmes/w172zssk89gkhf9",
    "source": "BBC News"
  },
  {
    "id": 35,
    "text": "Monday Night Club: Arsenal’s wobble, the case for Carrick & are Liverpool 'soft'?. All the reaction as top of the table Arsenal drop points to Manchester United.",
    "category": "health",
    "url": "https://www.bbc.co.uk/sounds/play/p0mxbjnm",
    "source": "BBC News"
  }
]